{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Connexion à Neo4j locale\n",
    "uri = \"bolt://localhost:7687\"  # Utilisation de l'URI locale\n",
    "username = \"neo4j\"  # Nom d'utilisateur par défaut\n",
    "password = \"password\"  # Mot de passe que tu as défini lors de l'installation\n",
    "\n",
    "# Créer un driver Neo4j\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "\n",
    "# Fonction pour charger les films avec LOAD CSV (création de nœuds Movie)\n",
    "def create_movies():\n",
    "    with driver.session() as session:\n",
    "        query = \"\"\"\n",
    "        LOAD CSV WITH HEADERS FROM 'file:///movies.csv' AS row\n",
    "        CREATE (m:Movie {\n",
    "            movieId: toInteger(row.movieId),\n",
    "            title: row.title,\n",
    "            genres: row.genres\n",
    "        })\n",
    "        \"\"\"\n",
    "        session.run(query)\n",
    "        print(\"Movies created.\")\n",
    "\n",
    "# Fonction pour charger les liens IMDB et TMDB avec links.csv\n",
    "def create_links():\n",
    "    with driver.session() as session:\n",
    "        query = \"\"\"\n",
    "        LOAD CSV WITH HEADERS FROM 'file:///links.csv' AS row\n",
    "        MATCH (m:Movie {movieId: toInteger(row.movieId)})\n",
    "        SET m.imdbId = toInteger(row.imdbId), m.tmdbId = toInteger(row.tmdbId)\n",
    "        \"\"\"\n",
    "        session.run(query)\n",
    "        print(\"Links loaded (IMDB and TMDB).\")\n",
    "\n",
    "# Fonction pour créer les utilisateurs avec des nœuds User\n",
    "def create_users():\n",
    "    with driver.session() as session:\n",
    "        query = \"\"\"\n",
    "        LOAD CSV WITH HEADERS FROM 'file:///ratings.csv' AS row\n",
    "        MERGE (u:User {userId: toInteger(row.userId)})\n",
    "        \"\"\"\n",
    "        session.run(query)\n",
    "        print(\"Users created.\")\n",
    "\n",
    "# Fonction pour créer les tags avec des nœuds Tag\n",
    "def create_tags():\n",
    "    with driver.session() as session:\n",
    "        query = \"\"\"\n",
    "        LOAD CSV WITH HEADERS FROM 'file:///genome-tags.csv' AS row\n",
    "        CREATE (:Tag {tagId: toInteger(row.tagId), tag: row.tag})\n",
    "        \"\"\"\n",
    "        session.run(query)\n",
    "        print(\"Tags created.\")\n",
    "\n",
    "# Fonction pour charger les relations d'évaluation avec LOAD CSV (création de relations RATED)\n",
    "def create_rated_relationships():\n",
    "    with driver.session() as session:\n",
    "        query = \"\"\"\n",
    "        LOAD CSV WITH HEADERS FROM 'file:///ratings.csv' AS row\n",
    "        MATCH (m:Movie {movieId: toInteger(row.movieId)})\n",
    "        MATCH (u:User {userId: toInteger(row.userId)})\n",
    "        CREATE (u)-[:RATED {rating: toFloat(row.rating), timestamp: toInteger(row.timestamp)}]->(m)\n",
    "        \"\"\"\n",
    "        session.run(query)\n",
    "        print(\"RATED relationships created.\")\n",
    "\n",
    "# Fonction pour charger les relations de tags avec LOAD CSV (création de relations TAGGED)\n",
    "def create_tagged_relationships():\n",
    "    with driver.session() as session:\n",
    "        query = \"\"\"\n",
    "        LOAD CSV WITH HEADERS FROM 'file:///tags.csv' AS row\n",
    "        MATCH (m:Movie {movieId: toInteger(row.movieId)})\n",
    "        MATCH (u:User {userId: toInteger(row.userId)})\n",
    "        CREATE (u)-[:TAGGED {tag: row.tag, timestamp: toInteger(row.timestamp)}]->(m)\n",
    "        \"\"\"\n",
    "        session.run(query)\n",
    "        print(\"TAGGED relationships created.\")\n",
    "\n",
    "# Fonction pour charger les scores de pertinence (HAS_TAG relations)\n",
    "def create_has_tag_relationships():\n",
    "    with driver.session() as session:\n",
    "        query = \"\"\"\n",
    "        LOAD CSV WITH HEADERS FROM 'file:///genome-scores.csv' AS row\n",
    "        MATCH (m:Movie {movieId: toInteger(row.movieId)})\n",
    "        MATCH (t:Tag {tagId: toInteger(row.tagId)})\n",
    "        CREATE (m)-[:HAS_TAG {relevance: toFloat(row.relevance)}]->(t)\n",
    "        \"\"\"\n",
    "        session.run(query)\n",
    "        print(\"HAS_TAG relationships created.\")\n",
    "\n",
    "\n",
    "# Charger les fichiers CSV dans Neo4j\n",
    "def load_data():\n",
    "    # Étape 1 : Créer les nœuds\n",
    "    create_movies()  # Créer les nœuds de films\n",
    "    create_links()  # Charger les liens IMDB et TMDB\n",
    "    create_users()   # Créer les nœuds d'utilisateurs\n",
    "    # create_tags()    # Créer les nœuds de tags\n",
    "\n",
    "    # Étape 2 : Créer les relations\n",
    "    create_rated_relationships()  # Créer les relations RATED\n",
    "    create_tagged_relationships()  # Créer les relations TAGGED\n",
    "    # create_has_tag_relationships()  # Créer les relations HAS_TAG\n",
    "\n",
    "# Exécuter l'import des données\n",
    "load_data()\n",
    "\n",
    "# Fermer la connexion Neo4j\n",
    "driver.close()\n",
    "print(\"Connexion à Neo4j fermée.\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### tous les film avec leur relations\n",
    "MATCH (m:Movie)\n",
    "OPTIONAL MATCH (m)<-[:TAGGED]-(u:User)  // Récupère les tags associés aux films via les utilisateurs\n",
    "OPTIONAL MATCH (m)<-[r:RATED]-(u2:User)  // Récupère les évaluations pour chaque film\n",
    "WITH m, collect(DISTINCT u.tag) AS tags, avg(r.rating) AS AverageRating  // Calcule la moyenne des évaluations et collecte les tags\n",
    "RETURN m.title AS MovieTitle, \n",
    "       tags, \n",
    "       split(m.genres, '|') AS GenresArray,  // Divise la chaîne de genres en tableau\n",
    "       coalesce(AverageRating, 0) AS AverageRating  // Utilise '0' s'il n'y a pas d'évaluations\n",
    "LIMIT 25\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### tous les film qui ont des tags avec la moyenne rating\n",
    "MATCH (m:Movie)\n",
    "OPTIONAL MATCH (m)<-[t:TAGGED]-(u:User)  // Récupère les relations TAGGED\n",
    "OPTIONAL MATCH (m)<-[r:RATED]-(u2:User)  // Récupère les évaluations pour chaque film\n",
    "WITH m, collect(DISTINCT t.tag) AS tags, avg(r.rating) AS AverageRating  // Calcule la moyenne des évaluations et collecte les tags\n",
    "WHERE size(tags) > 0  // Filtre pour ne récupérer que les films qui ont des tags\n",
    "RETURN m.title AS MovieTitle, \n",
    "       m.movieId,\n",
    "       tags, \n",
    "       split(m.genres, '|') AS GenresArray,  // Divise la chaîne de genres en tableau\n",
    "       coalesce(AverageRating, 0) AS AverageRating  // Utilise '0' s'il n'y a pas d'évaluations\n",
    "LIMIT 25"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Requête pour afficher tous les types de tags :\n",
    "\n",
    "MATCH (m:Movie)<-[t:TAGGED]-(u:User)\n",
    "RETURN DISTINCT t.tag AS Tag\n",
    "ORDER BY Tag\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Requête de recherche par tag spécifique :\n",
    "\n",
    "MATCH (m:Movie)<-[t:TAGGED]-(u:User)\n",
    "WHERE t.tag = 'Cold War'  // Remplacez 'votre_tag_ici' par le tag que vous recherchez\n",
    "OPTIONAL MATCH (m)<-[r:RATED]-(u2:User)\n",
    "WITH m, collect(DISTINCT t.tag) AS tags, avg(r.rating) AS AverageRating\n",
    "RETURN m.title AS MovieTitle, \n",
    "       m.movieId, \n",
    "       tags, \n",
    "       split(m.genres, '|') AS GenresArray,  // Divise la chaîne de genres en tableau\n",
    "       coalesce(AverageRating, 0) AS AverageRating  // Utilise '0' s'il n'y a pas d'évaluations\n",
    "LIMIT 25\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Requête pour afficher tous les genres distincts :\n",
    "\n",
    "MATCH (m:Movie)\n",
    "WITH m, split(m.genres, '|') AS genreList  // Décompose les genres\n",
    "UNWIND genreList AS genre  // Sépare chaque genre en une ligne distincte\n",
    "RETURN DISTINCT genre  // Récupère uniquement les genres distincts\n",
    "ORDER BY genre\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Requête pour rechercher des films avec plusieurs genres :\n",
    "\n",
    "MATCH (m:Movie)\n",
    "WHERE ALL(genre IN ['Action', 'Adventure'] \n",
    "          WHERE genre IN split(m.genres, '|'))  // Vérifie si tous les genres spécifiés sont présents\n",
    "RETURN m.title AS MovieTitle, \n",
    "       split(m.genres, '|') AS GenresArray  // Divise la chaîne de genres en tableau\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Requête pour Afficher un film et afficher toutes ses informations :\n",
    "\n",
    "MATCH (m:Movie {movieId: 1})  // Remplacer '1' par l'ID du film à rechercher\n",
    "OPTIONAL MATCH (m)<-[r:RATED]-(u:User)  // Récupère les évaluations pour le film\n",
    "OPTIONAL MATCH (m)<-[t:TAGGED]-(u2:User)  // Récupère les tags associés au film par utilisateur\n",
    "WITH m, u.userId AS UserId, r.rating AS Rating, collect(t.tag) AS Tags  // Collecte les tags associés pour chaque utilisateur\n",
    "WITH m, collect({\n",
    "    userId: UserId,  // Crée un objet utilisateur\n",
    "    rating: Rating,  // Inclut la note donnée\n",
    "    tags: Tags       // Inclut les tags associés\n",
    "}) AS UsersInfo\n",
    "RETURN m.movieId AS MovieID, \n",
    "       m.title AS Title, \n",
    "       split(m.genres, '|') AS Genres,  // Affiche les genres en tableau\n",
    "       m.imdbId AS IMDB_ID, \n",
    "       m.tmdbId AS TMDB_ID,\n",
    "       UsersInfo[0..25] AS PaginatedUsersInfo  // Pagination manuelle avec plage d'index\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Requête Cypher pour rechercher des films contenant une séquence de caractères dans leur titre :\n",
    "\n",
    "MATCH (m:Movie)\n",
    "WHERE toLower(m.title) CONTAINS toLower('toy')\n",
    "RETURN m.movieId AS MovieID, \n",
    "       m.title AS Title, \n",
    "       split(m.genres, '|') AS Genres,\n",
    "       m.imdbId AS IMDB_ID, \n",
    "       m.tmdbId AS TMDB_ID\n",
    "LIMIT 25\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Authentification réussie\n",
      "Film Information:  {'status': 'success', 'data': {'movieDetails': {'movieId': 1, 'rec_val_type': '', 'tstamp': None, 'movie': {'movieId': 1, 'tmdbMovieId': 862, 'imdbMovieId': '0114709', 'title': 'Toy Story', 'originalTitle': 'Toy Story', 'mpaa': 'G', 'runtime': 81, 'releaseDate': '1995-10-30', 'dvdReleaseDate': '2001-03-20', 'genres': ['Animation', 'Adventure', 'Family', 'Comedy'], 'languages': ['English'], 'directors': ['John Lasseter'], 'actors': ['Tom Hanks', 'Tim Allen', 'Don Rickles', 'Jim Varney', 'Wallace Shawn', 'John Ratzenberger', 'Annie Potts', 'John Morris', 'Erik von Detten', 'Laurie Metcalf', 'R. Lee Ermey', 'Sarah Freeman', 'Penn Jillette', 'Jack Angel', 'Spencer Aste', 'Greg Berg', 'Lisa Bradley', 'Kendall Cunningham', 'Debi Derryberry', 'Cody Dorkin', 'Bill Farmer', 'Craig Good', 'Gregory Grudt', 'Danielle Judovits', 'Sam Lasseter', 'Brittany Levenbrown', 'Sherry Lynn', 'Scott McAfee', 'Mickie McGowan', \"Ryan O'Donohue\", 'Jeff Pidgeon', 'Patrick Pinney', 'Phil Proctor', 'Jan Rabson', 'Joe Ranft', 'Andrew Stanton', 'Shane Sweet', 'John Lasseter', 'Jonathan Benair', 'Anthony Burch', 'Tracy Fraim'], 'posterPath': '/uXDfjJbdP4ijW5hWSBrPrlKpxab.jpg', 'backdropPaths': ['/lxD5ak7BOoinRNehOCA85CQ8ubr.jpg', '/39QpDXKtzVP4gkGxZIkjJNkOTWr.jpg', '/HAL8AHcfFB8QRcRpFi5DCyR0i8.jpg', '/3Rfvhy1Nl6sSGJwyjb0QiZzZYlB.jpg', '/uWEK5ivO2Lyvbf5AgNZ1rBVVfiI.jpg', '/wXTMod0lcLMtQy6Tz9yBP2wF4F1.jpg', '/dLUvaPD1WHXFLBTiQoJodGyrkkk.jpg', '/inzobKFeEeV1gEm6Ci2woeFNgsG.jpg', '/aNVNJKfDlK28dRSwa3HkXlW1h6f.jpg', '/gu03u9mGCsdglIvjmkhQJg9cwq3.jpg', '/fAfOiNG0t0Sn1wCGLcHOj62AZWU.jpg', '/yfDueavdABHG830OoovTmNw3zf9.jpg', '/bSoOThXLrbgtphS2eZjwy2xYwVt.jpg', '/XLwjO1NSCIaLznh58OQtmSFl0N.jpg', '/e6bG3pp3cpImIDObC62bxmsarto.jpg', '/1u1jLdl0vthf3VZRd0bdZltLGQK.jpg', '/2lhpf6ymXxDHSPQ3TlcQFQrTDgK.jpg', '/w620zb5fZW0QBQlM8pZwftzBaJj.jpg', '/j2EFHNmwqjzGjdcbtJ5TgO33h8O.jpg', '/bIqPTQUj82JhAwWC6e71dqc8ZQ0.jpg', '/npzChb0QUK16uMWTZk5wiNUyxOs.jpg', '/etxucWWtDAKeeatj9qsvevTrt6s.jpg', '/md5ifsJa1Mqdvj4a2XsJjrD4kCa.jpg', '/m7mkW45uxEuWTOljRCaXlwkkomA.jpg', '/bdTHB7F9ygghl8ieS6K2NjOTNLZ.jpg', '/mgDx949ekEBF56nAfGjVHfi6436.jpg', '/5yF8PIURNSTXO0ETdNpGNch2uEE.jpg', '/oSqfUNL4Fh6jcGTY3B5VIWIStt.jpg', '/3hFssBoTefvHA2AC6aTzhPcvFiM.jpg', '/zqgTw5dJlQV8pehFK8u9UKNM8kQ.jpg', '/8AqWECiUHnz1Crj69uB9vhiK9Le.jpg', '/lsBVZG2y2reRzVi9aTQRWHk9Voj.jpg', '/d3rjUFzytkfy5Rw0rnJSPRtMIqV.jpg', '/1pFGRMwuVPcbk0fHeV5IFCj7w8W.jpg', '/gYyfVAoGfpDQjxCGQWgzgg3VmbX.jpg', '/8kcGmTOLdTmqdv78ToDVQQFD50S.jpg', '/w1xMRxUVDQ4tklyqPdXLf53rcsq.jpg', '/bKDwZgO050C1dXuuJL2qw1uo1PD.jpg'], 'youtubeTrailerIds': ['tN1A2mVnrOM', 'CxwTLktovTU', 'eceq_lHyxBc', 'dQOEFxKwelk'], 'plotSummary': \"Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.\", 'numRatings': 78787, 'avgRating': 3.89362, 'releaseYear': '1995'}, 'movieUserData': {'userId': 415549, 'movieId': 1, 'rating': None, 'dateRated': None, 'prediction': 3.7798005410933952, 'wishlist': False, 'hidden': False, 'predictionDetails': {'primaryPrediction': 3.7798005410933952, 'primaryPredictionType': 'USER', 'components': [{'pred': 3.7798005410933952, 'type': 'USER'}, {'pred': 3.8934930742663862, 'type': 'FALLBACK'}]}}}}}\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "\n",
    "# URL pour l'authentification et l'obtention d'une session\n",
    "auth_url = \"https://movielens.org/api/sessions\"\n",
    "auth_data = {\n",
    "    \"userName\": \"atf202\",\n",
    "    \"password\": \"Bouboule12345\"\n",
    "}\n",
    "\n",
    "# Créer une session pour gérer les cookies\n",
    "session = requests.Session()\n",
    "\n",
    "# Effectuer l'appel POST pour obtenir l'authentification avec gestion des cookies\n",
    "response = session.post(auth_url, json=auth_data)\n",
    "\n",
    "if response.status_code == 200:\n",
    "    # L'authentification a réussi, les cookies sont automatiquement stockés dans la session\n",
    "    print(\"Authentification réussie\")\n",
    "\n",
    "    # URL pour récupérer les informations sur un film\n",
    "    movie_url = \"https://movielens.org/api/movies/1\"\n",
    "\n",
    "    # Effectuer l'appel GET avec la session pour récupérer les informations du film\n",
    "    movie_response = session.get(movie_url)\n",
    "\n",
    "    if movie_response.status_code == 200:\n",
    "        movie_info = movie_response.json()\n",
    "        print(\"Film Information: \", movie_info)\n",
    "    else:\n",
    "        print(f\"Échec de la récupération des informations du film: {movie_response.status_code}\")\n",
    "else:\n",
    "    print(f\"Échec de l'authentification: {response.status_code}\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "_______________________________________________________________________________________________________________________________________________________________\n",
    "\n",
    "## A rajouté au future"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Initializing Neo4j connection...\n",
      "Neo4j connection initialized successfully.\n",
      "Starting movie update process...\n",
      "Starting the movie update process...\n",
      "Processing batch 0 of movies...\n",
      "Fetching movies from Neo4j, page 0 with batch size 1000...\n",
      "Fetched 1000 movies from page 0.\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[10], line 139\u001b[0m\n\u001b[0;32m    137\u001b[0m \u001b[38;5;66;03m# Exécuter la mise à jour des films\u001b[39;00m\n\u001b[0;32m    138\u001b[0m \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mStarting movie update process...\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m--> 139\u001b[0m update_movies_with_api_details()\n\u001b[0;32m    141\u001b[0m \u001b[38;5;66;03m# Fermer la connexion Neo4j\u001b[39;00m\n\u001b[0;32m    142\u001b[0m driver\u001b[38;5;241m.\u001b[39mclose()\n",
      "Cell \u001b[1;32mIn[10], line 125\u001b[0m, in \u001b[0;36mupdate_movies_with_api_details\u001b[1;34m()\u001b[0m\n\u001b[0;32m    122\u001b[0m movie_id \u001b[38;5;241m=\u001b[39m movie_record[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmovieId\u001b[39m\u001b[38;5;124m\"\u001b[39m]\n\u001b[0;32m    124\u001b[0m \u001b[38;5;66;03m# Récupérer les détails du film depuis l'API\u001b[39;00m\n\u001b[1;32m--> 125\u001b[0m movie_data \u001b[38;5;241m=\u001b[39m get_movie_details_from_movielens_api(movie_id)\n\u001b[0;32m    126\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m movie_data:\n\u001b[0;32m    127\u001b[0m     \u001b[38;5;66;03m# Mettre à jour le film dans Neo4j avec les champs spécifiques\u001b[39;00m\n\u001b[0;32m    128\u001b[0m     create_or_update_movie_in_neo4j(movie_data)\n",
      "Cell \u001b[1;32mIn[10], line 78\u001b[0m, in \u001b[0;36mget_movie_details_from_movielens_api\u001b[1;34m(movie_id)\u001b[0m\n\u001b[0;32m     76\u001b[0m \u001b[38;5;66;03m# Créer une session pour les requêtes avec cookies\u001b[39;00m\n\u001b[0;32m     77\u001b[0m session \u001b[38;5;241m=\u001b[39m requests\u001b[38;5;241m.\u001b[39mSession()\n\u001b[1;32m---> 78\u001b[0m response \u001b[38;5;241m=\u001b[39m session\u001b[38;5;241m.\u001b[39mpost(auth_url, json\u001b[38;5;241m=\u001b[39mauth_data)\n\u001b[0;32m     80\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m response\u001b[38;5;241m.\u001b[39mstatus_code \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m200\u001b[39m:\n\u001b[0;32m     81\u001b[0m     movie_url \u001b[38;5;241m=\u001b[39m \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mhttps://movielens.org/api/movies/\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mmovie_id\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\site-packages\\requests\\sessions.py:637\u001b[0m, in \u001b[0;36mSession.post\u001b[1;34m(self, url, data, json, **kwargs)\u001b[0m\n\u001b[0;32m    626\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mpost\u001b[39m(\u001b[38;5;28mself\u001b[39m, url, data\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m, json\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[0;32m    627\u001b[0m \u001b[38;5;250m    \u001b[39m\u001b[38;5;124mr\u001b[39m\u001b[38;5;124;03m\"\"\"Sends a POST request. Returns :class:`Response` object.\u001b[39;00m\n\u001b[0;32m    628\u001b[0m \n\u001b[0;32m    629\u001b[0m \u001b[38;5;124;03m    :param url: URL for the new :class:`Request` object.\u001b[39;00m\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m    634\u001b[0m \u001b[38;5;124;03m    :rtype: requests.Response\u001b[39;00m\n\u001b[0;32m    635\u001b[0m \u001b[38;5;124;03m    \"\"\"\u001b[39;00m\n\u001b[1;32m--> 637\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mrequest(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mPOST\u001b[39m\u001b[38;5;124m\"\u001b[39m, url, data\u001b[38;5;241m=\u001b[39mdata, json\u001b[38;5;241m=\u001b[39mjson, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\site-packages\\requests\\sessions.py:589\u001b[0m, in \u001b[0;36mSession.request\u001b[1;34m(self, method, url, params, data, headers, cookies, files, auth, timeout, allow_redirects, proxies, hooks, stream, verify, cert, json)\u001b[0m\n\u001b[0;32m    584\u001b[0m send_kwargs \u001b[38;5;241m=\u001b[39m {\n\u001b[0;32m    585\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mtimeout\u001b[39m\u001b[38;5;124m\"\u001b[39m: timeout,\n\u001b[0;32m    586\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mallow_redirects\u001b[39m\u001b[38;5;124m\"\u001b[39m: allow_redirects,\n\u001b[0;32m    587\u001b[0m }\n\u001b[0;32m    588\u001b[0m send_kwargs\u001b[38;5;241m.\u001b[39mupdate(settings)\n\u001b[1;32m--> 589\u001b[0m resp \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39msend(prep, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39msend_kwargs)\n\u001b[0;32m    591\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m resp\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\site-packages\\requests\\sessions.py:703\u001b[0m, in \u001b[0;36mSession.send\u001b[1;34m(self, request, **kwargs)\u001b[0m\n\u001b[0;32m    700\u001b[0m start \u001b[38;5;241m=\u001b[39m preferred_clock()\n\u001b[0;32m    702\u001b[0m \u001b[38;5;66;03m# Send the request\u001b[39;00m\n\u001b[1;32m--> 703\u001b[0m r \u001b[38;5;241m=\u001b[39m adapter\u001b[38;5;241m.\u001b[39msend(request, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m    705\u001b[0m \u001b[38;5;66;03m# Total elapsed time of the request (approximately)\u001b[39;00m\n\u001b[0;32m    706\u001b[0m elapsed \u001b[38;5;241m=\u001b[39m preferred_clock() \u001b[38;5;241m-\u001b[39m start\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\site-packages\\requests\\adapters.py:486\u001b[0m, in \u001b[0;36mHTTPAdapter.send\u001b[1;34m(self, request, stream, timeout, verify, cert, proxies)\u001b[0m\n\u001b[0;32m    483\u001b[0m     timeout \u001b[38;5;241m=\u001b[39m TimeoutSauce(connect\u001b[38;5;241m=\u001b[39mtimeout, read\u001b[38;5;241m=\u001b[39mtimeout)\n\u001b[0;32m    485\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 486\u001b[0m     resp \u001b[38;5;241m=\u001b[39m conn\u001b[38;5;241m.\u001b[39murlopen(\n\u001b[0;32m    487\u001b[0m         method\u001b[38;5;241m=\u001b[39mrequest\u001b[38;5;241m.\u001b[39mmethod,\n\u001b[0;32m    488\u001b[0m         url\u001b[38;5;241m=\u001b[39murl,\n\u001b[0;32m    489\u001b[0m         body\u001b[38;5;241m=\u001b[39mrequest\u001b[38;5;241m.\u001b[39mbody,\n\u001b[0;32m    490\u001b[0m         headers\u001b[38;5;241m=\u001b[39mrequest\u001b[38;5;241m.\u001b[39mheaders,\n\u001b[0;32m    491\u001b[0m         redirect\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mFalse\u001b[39;00m,\n\u001b[0;32m    492\u001b[0m         assert_same_host\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mFalse\u001b[39;00m,\n\u001b[0;32m    493\u001b[0m         preload_content\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mFalse\u001b[39;00m,\n\u001b[0;32m    494\u001b[0m         decode_content\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mFalse\u001b[39;00m,\n\u001b[0;32m    495\u001b[0m         retries\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mmax_retries,\n\u001b[0;32m    496\u001b[0m         timeout\u001b[38;5;241m=\u001b[39mtimeout,\n\u001b[0;32m    497\u001b[0m         chunked\u001b[38;5;241m=\u001b[39mchunked,\n\u001b[0;32m    498\u001b[0m     )\n\u001b[0;32m    500\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ProtocolError, \u001b[38;5;167;01mOSError\u001b[39;00m) \u001b[38;5;28;01mas\u001b[39;00m err:\n\u001b[0;32m    501\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mConnectionError\u001b[39;00m(err, request\u001b[38;5;241m=\u001b[39mrequest)\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\site-packages\\urllib3\\connectionpool.py:714\u001b[0m, in \u001b[0;36mHTTPConnectionPool.urlopen\u001b[1;34m(self, method, url, body, headers, retries, redirect, assert_same_host, timeout, pool_timeout, release_conn, chunked, body_pos, **response_kw)\u001b[0m\n\u001b[0;32m    711\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_prepare_proxy(conn)\n\u001b[0;32m    713\u001b[0m \u001b[38;5;66;03m# Make the request on the httplib connection object.\u001b[39;00m\n\u001b[1;32m--> 714\u001b[0m httplib_response \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_make_request(\n\u001b[0;32m    715\u001b[0m     conn,\n\u001b[0;32m    716\u001b[0m     method,\n\u001b[0;32m    717\u001b[0m     url,\n\u001b[0;32m    718\u001b[0m     timeout\u001b[38;5;241m=\u001b[39mtimeout_obj,\n\u001b[0;32m    719\u001b[0m     body\u001b[38;5;241m=\u001b[39mbody,\n\u001b[0;32m    720\u001b[0m     headers\u001b[38;5;241m=\u001b[39mheaders,\n\u001b[0;32m    721\u001b[0m     chunked\u001b[38;5;241m=\u001b[39mchunked,\n\u001b[0;32m    722\u001b[0m )\n\u001b[0;32m    724\u001b[0m \u001b[38;5;66;03m# If we're going to release the connection in ``finally:``, then\u001b[39;00m\n\u001b[0;32m    725\u001b[0m \u001b[38;5;66;03m# the response doesn't need to know about the connection. Otherwise\u001b[39;00m\n\u001b[0;32m    726\u001b[0m \u001b[38;5;66;03m# it will also try to release it and we'll have a double-release\u001b[39;00m\n\u001b[0;32m    727\u001b[0m \u001b[38;5;66;03m# mess.\u001b[39;00m\n\u001b[0;32m    728\u001b[0m response_conn \u001b[38;5;241m=\u001b[39m conn \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m release_conn \u001b[38;5;28;01melse\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\site-packages\\urllib3\\connectionpool.py:403\u001b[0m, in \u001b[0;36mHTTPConnectionPool._make_request\u001b[1;34m(self, conn, method, url, timeout, chunked, **httplib_request_kw)\u001b[0m\n\u001b[0;32m    401\u001b[0m \u001b[38;5;66;03m# Trigger any extra validation we need to do.\u001b[39;00m\n\u001b[0;32m    402\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 403\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_validate_conn(conn)\n\u001b[0;32m    404\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (SocketTimeout, BaseSSLError) \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[0;32m    405\u001b[0m     \u001b[38;5;66;03m# Py2 raises this as a BaseSSLError, Py3 raises it as socket timeout.\u001b[39;00m\n\u001b[0;32m    406\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_raise_timeout(err\u001b[38;5;241m=\u001b[39me, url\u001b[38;5;241m=\u001b[39murl, timeout_value\u001b[38;5;241m=\u001b[39mconn\u001b[38;5;241m.\u001b[39mtimeout)\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\site-packages\\urllib3\\connectionpool.py:1053\u001b[0m, in \u001b[0;36mHTTPSConnectionPool._validate_conn\u001b[1;34m(self, conn)\u001b[0m\n\u001b[0;32m   1051\u001b[0m \u001b[38;5;66;03m# Force connect early to allow us to validate the connection.\u001b[39;00m\n\u001b[0;32m   1052\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28mgetattr\u001b[39m(conn, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124msock\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;28;01mNone\u001b[39;00m):  \u001b[38;5;66;03m# AppEngine might not have  `.sock`\u001b[39;00m\n\u001b[1;32m-> 1053\u001b[0m     conn\u001b[38;5;241m.\u001b[39mconnect()\n\u001b[0;32m   1055\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m conn\u001b[38;5;241m.\u001b[39mis_verified:\n\u001b[0;32m   1056\u001b[0m     warnings\u001b[38;5;241m.\u001b[39mwarn(\n\u001b[0;32m   1057\u001b[0m         (\n\u001b[0;32m   1058\u001b[0m             \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mUnverified HTTPS request is being made to host \u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;132;01m%s\u001b[39;00m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124m. \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m   1063\u001b[0m         InsecureRequestWarning,\n\u001b[0;32m   1064\u001b[0m     )\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\site-packages\\urllib3\\connection.py:419\u001b[0m, in \u001b[0;36mHTTPSConnection.connect\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    410\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m (\n\u001b[0;32m    411\u001b[0m     \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mca_certs\n\u001b[0;32m    412\u001b[0m     \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mca_cert_dir\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m    415\u001b[0m     \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;28mhasattr\u001b[39m(context, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mload_default_certs\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m    416\u001b[0m ):\n\u001b[0;32m    417\u001b[0m     context\u001b[38;5;241m.\u001b[39mload_default_certs()\n\u001b[1;32m--> 419\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39msock \u001b[38;5;241m=\u001b[39m ssl_wrap_socket(\n\u001b[0;32m    420\u001b[0m     sock\u001b[38;5;241m=\u001b[39mconn,\n\u001b[0;32m    421\u001b[0m     keyfile\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mkey_file,\n\u001b[0;32m    422\u001b[0m     certfile\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcert_file,\n\u001b[0;32m    423\u001b[0m     key_password\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mkey_password,\n\u001b[0;32m    424\u001b[0m     ca_certs\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mca_certs,\n\u001b[0;32m    425\u001b[0m     ca_cert_dir\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mca_cert_dir,\n\u001b[0;32m    426\u001b[0m     ca_cert_data\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mca_cert_data,\n\u001b[0;32m    427\u001b[0m     server_hostname\u001b[38;5;241m=\u001b[39mserver_hostname,\n\u001b[0;32m    428\u001b[0m     ssl_context\u001b[38;5;241m=\u001b[39mcontext,\n\u001b[0;32m    429\u001b[0m     tls_in_tls\u001b[38;5;241m=\u001b[39mtls_in_tls,\n\u001b[0;32m    430\u001b[0m )\n\u001b[0;32m    432\u001b[0m \u001b[38;5;66;03m# If we're using all defaults and the connection\u001b[39;00m\n\u001b[0;32m    433\u001b[0m \u001b[38;5;66;03m# is TLSv1 or TLSv1.1 we throw a DeprecationWarning\u001b[39;00m\n\u001b[0;32m    434\u001b[0m \u001b[38;5;66;03m# for the host.\u001b[39;00m\n\u001b[0;32m    435\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m (\n\u001b[0;32m    436\u001b[0m     default_ssl_context\n\u001b[0;32m    437\u001b[0m     \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mssl_version \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m\n\u001b[0;32m    438\u001b[0m     \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;28mhasattr\u001b[39m(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39msock, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mversion\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m    439\u001b[0m     \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39msock\u001b[38;5;241m.\u001b[39mversion() \u001b[38;5;129;01min\u001b[39;00m {\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mTLSv1\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mTLSv1.1\u001b[39m\u001b[38;5;124m\"\u001b[39m}\n\u001b[0;32m    440\u001b[0m ):\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\site-packages\\urllib3\\util\\ssl_.py:449\u001b[0m, in \u001b[0;36mssl_wrap_socket\u001b[1;34m(sock, keyfile, certfile, cert_reqs, ca_certs, server_hostname, ssl_version, ciphers, ssl_context, ca_cert_dir, key_password, ca_cert_data, tls_in_tls)\u001b[0m\n\u001b[0;32m    437\u001b[0m     warnings\u001b[38;5;241m.\u001b[39mwarn(\n\u001b[0;32m    438\u001b[0m         \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mAn HTTPS request has been made, but the SNI (Server Name \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m    439\u001b[0m         \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mIndication) extension to TLS is not available on this platform. \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m    445\u001b[0m         SNIMissingWarning,\n\u001b[0;32m    446\u001b[0m     )\n\u001b[0;32m    448\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m send_sni:\n\u001b[1;32m--> 449\u001b[0m     ssl_sock \u001b[38;5;241m=\u001b[39m _ssl_wrap_socket_impl(\n\u001b[0;32m    450\u001b[0m         sock, context, tls_in_tls, server_hostname\u001b[38;5;241m=\u001b[39mserver_hostname\n\u001b[0;32m    451\u001b[0m     )\n\u001b[0;32m    452\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[0;32m    453\u001b[0m     ssl_sock \u001b[38;5;241m=\u001b[39m _ssl_wrap_socket_impl(sock, context, tls_in_tls)\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\site-packages\\urllib3\\util\\ssl_.py:493\u001b[0m, in \u001b[0;36m_ssl_wrap_socket_impl\u001b[1;34m(sock, ssl_context, tls_in_tls, server_hostname)\u001b[0m\n\u001b[0;32m    490\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m SSLTransport(sock, ssl_context, server_hostname)\n\u001b[0;32m    492\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m server_hostname:\n\u001b[1;32m--> 493\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m ssl_context\u001b[38;5;241m.\u001b[39mwrap_socket(sock, server_hostname\u001b[38;5;241m=\u001b[39mserver_hostname)\n\u001b[0;32m    494\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[0;32m    495\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m ssl_context\u001b[38;5;241m.\u001b[39mwrap_socket(sock)\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\ssl.py:517\u001b[0m, in \u001b[0;36mSSLContext.wrap_socket\u001b[1;34m(self, sock, server_side, do_handshake_on_connect, suppress_ragged_eofs, server_hostname, session)\u001b[0m\n\u001b[0;32m    511\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mwrap_socket\u001b[39m(\u001b[38;5;28mself\u001b[39m, sock, server_side\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mFalse\u001b[39;00m,\n\u001b[0;32m    512\u001b[0m                 do_handshake_on_connect\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mTrue\u001b[39;00m,\n\u001b[0;32m    513\u001b[0m                 suppress_ragged_eofs\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mTrue\u001b[39;00m,\n\u001b[0;32m    514\u001b[0m                 server_hostname\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m, session\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m):\n\u001b[0;32m    515\u001b[0m     \u001b[38;5;66;03m# SSLSocket class handles server_hostname encoding before it calls\u001b[39;00m\n\u001b[0;32m    516\u001b[0m     \u001b[38;5;66;03m# ctx._wrap_socket()\u001b[39;00m\n\u001b[1;32m--> 517\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39msslsocket_class\u001b[38;5;241m.\u001b[39m_create(\n\u001b[0;32m    518\u001b[0m         sock\u001b[38;5;241m=\u001b[39msock,\n\u001b[0;32m    519\u001b[0m         server_side\u001b[38;5;241m=\u001b[39mserver_side,\n\u001b[0;32m    520\u001b[0m         do_handshake_on_connect\u001b[38;5;241m=\u001b[39mdo_handshake_on_connect,\n\u001b[0;32m    521\u001b[0m         suppress_ragged_eofs\u001b[38;5;241m=\u001b[39msuppress_ragged_eofs,\n\u001b[0;32m    522\u001b[0m         server_hostname\u001b[38;5;241m=\u001b[39mserver_hostname,\n\u001b[0;32m    523\u001b[0m         context\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m,\n\u001b[0;32m    524\u001b[0m         session\u001b[38;5;241m=\u001b[39msession\n\u001b[0;32m    525\u001b[0m     )\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\ssl.py:1108\u001b[0m, in \u001b[0;36mSSLSocket._create\u001b[1;34m(cls, sock, server_side, do_handshake_on_connect, suppress_ragged_eofs, server_hostname, context, session)\u001b[0m\n\u001b[0;32m   1105\u001b[0m         \u001b[38;5;28;01mif\u001b[39;00m timeout \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0.0\u001b[39m:\n\u001b[0;32m   1106\u001b[0m             \u001b[38;5;66;03m# non-blocking\u001b[39;00m\n\u001b[0;32m   1107\u001b[0m             \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mdo_handshake_on_connect should not be specified for non-blocking sockets\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m-> 1108\u001b[0m         \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mdo_handshake()\n\u001b[0;32m   1109\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (\u001b[38;5;167;01mOSError\u001b[39;00m, \u001b[38;5;167;01mValueError\u001b[39;00m):\n\u001b[0;32m   1110\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mclose()\n",
      "File \u001b[1;32mc:\\Users\\atdf2\\anaconda3\\Lib\\ssl.py:1379\u001b[0m, in \u001b[0;36mSSLSocket.do_handshake\u001b[1;34m(self, block)\u001b[0m\n\u001b[0;32m   1377\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m timeout \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0.0\u001b[39m \u001b[38;5;129;01mand\u001b[39;00m block:\n\u001b[0;32m   1378\u001b[0m         \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39msettimeout(\u001b[38;5;28;01mNone\u001b[39;00m)\n\u001b[1;32m-> 1379\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_sslobj\u001b[38;5;241m.\u001b[39mdo_handshake()\n\u001b[0;32m   1380\u001b[0m \u001b[38;5;28;01mfinally\u001b[39;00m:\n\u001b[0;32m   1381\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39msettimeout(timeout)\n",
      "\u001b[1;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "# import requests\n",
    "# from neo4j import GraphDatabase\n",
    "\n",
    "# # Connexion à Neo4j locale\n",
    "# uri = \"bolt://localhost:7687\"  # Utilisation de l'URI locale\n",
    "# username = \"neo4j\"\n",
    "# password = \"password\"\n",
    "\n",
    "# # Créer un driver Neo4j\n",
    "# print(\"Initializing Neo4j connection...\")\n",
    "# driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "# print(\"Neo4j connection initialized successfully.\")\n",
    "\n",
    "# # Fonction pour récupérer les films par blocs depuis Neo4j\n",
    "# def get_movies_from_neo4j(batch_size=1000, page=0):\n",
    "#     print(f\"Fetching movies from Neo4j, page {page} with batch size {batch_size}...\")\n",
    "#     with driver.session() as session:\n",
    "#         result = session.run(\"\"\"\n",
    "#         MATCH (m:Movie)\n",
    "#         RETURN m.movieId AS movieId\n",
    "#         SKIP $skip LIMIT $limit\n",
    "#         \"\"\", skip=page * batch_size, limit=batch_size)\n",
    "#         movies = result.data()\n",
    "#         print(f\"Fetched {len(movies)} movies from page {page}.\")\n",
    "#         return movies\n",
    "\n",
    "# # Fonction pour mettre à jour les films avec les informations obtenues depuis l'API\n",
    "# def create_or_update_movie_in_neo4j(movie_data):\n",
    "#     with driver.session() as session:\n",
    "#         query = \"\"\"\n",
    "#         MERGE (m:Movie {movieId: $movieId})\n",
    "#         SET m.title = $title,\n",
    "#             m.genres = $genres,\n",
    "#             m.imdbId = $imdbId,\n",
    "#             m.tmdbId = $tmdbId,\n",
    "#             m.posterPath = $posterPath,\n",
    "#             m.backdropPaths = $backdropPaths,\n",
    "#             m.plotSummary = $plotSummary,\n",
    "#             m.releaseDate = $releaseDate,\n",
    "#             m.youtubeTrailerIds = $youtubeTrailerIds\n",
    "#         \"\"\"\n",
    "#         session.run(query, movieId=movie_data[\"movieId\"],\n",
    "#                     title=movie_data[\"title\"],\n",
    "#                     genres=\"|\".join(movie_data[\"genres\"]),\n",
    "#                     imdbId=movie_data[\"imdbMovieId\"],\n",
    "#                     tmdbId=movie_data[\"tmdbMovieId\"],\n",
    "#                     posterPath=f\"https://image.tmdb.org/t/p/original{movie_data['posterPath']}\",\n",
    "#                     backdropPaths=\"|\".join([f\"https://image.tmdb.org/t/p/original{path}\" for path in movie_data[\"backdropPaths\"]]),\n",
    "#                     plotSummary=movie_data[\"plotSummary\"],\n",
    "#                     releaseDate=movie_data[\"releaseDate\"],\n",
    "#                     youtubeTrailerIds=\"|\".join(movie_data[\"youtubeTrailerIds\"]))\n",
    "#         # Pas de print ici pour chaque film pour éviter un log trop verbeux.\n",
    "\n",
    "# # Fonction pour créer les relations acteurs et réalisateurs\n",
    "# def create_actors_and_directors_in_neo4j(movie_id, actors, directors):\n",
    "#     with driver.session() as session:\n",
    "#         for actor in actors:\n",
    "#             session.run(\"\"\"\n",
    "#             MERGE (a:Actor {name: $actorName})\n",
    "#             MERGE (m:Movie {movieId: $movieId})\n",
    "#             MERGE (a)-[:ACTED_IN]->(m)\n",
    "#             \"\"\", actorName=actor, movieId=movie_id)\n",
    "#         for director in directors:\n",
    "#             session.run(\"\"\"\n",
    "#             MERGE (d:Director {name: $directorName})\n",
    "#             MERGE (m:Movie {movieId: $movieId})\n",
    "#             MERGE (d)-[:DIRECTED]->(m)\n",
    "#             \"\"\", directorName=director, movieId=movie_id)\n",
    "#         # Pas de print pour chaque acteur/réalisateur pour éviter un log trop verbeux.\n",
    "\n",
    "# # Fonction pour récupérer les détails du film à partir de l'API MovieLens\n",
    "# def get_movie_details_from_movielens_api(movie_id):\n",
    "#     auth_url = \"https://movielens.org/api/sessions\"\n",
    "#     auth_data = {\"userName\": \"atf202\", \"password\": \"Bouboule12345\"}\n",
    "    \n",
    "#     # Créer une session pour les requêtes avec cookies\n",
    "#     session = requests.Session()\n",
    "#     response = session.post(auth_url, json=auth_data)\n",
    "    \n",
    "#     if response.status_code == 200:\n",
    "#         movie_url = f\"https://movielens.org/api/movies/{movie_id}\"\n",
    "#         movie_response = session.get(movie_url)\n",
    "        \n",
    "#         if movie_response.status_code == 200:\n",
    "#             movie_data = movie_response.json()[\"data\"][\"movieDetails\"][\"movie\"]\n",
    "#             return {\n",
    "#                 \"movieId\": movie_data[\"movieId\"],\n",
    "#                 \"title\": movie_data[\"title\"],\n",
    "#                 \"genres\": movie_data[\"genres\"],\n",
    "#                 \"imdbMovieId\": movie_data[\"imdbMovieId\"],\n",
    "#                 \"tmdbMovieId\": movie_data[\"tmdbMovieId\"],\n",
    "#                 \"posterPath\": movie_data[\"posterPath\"],\n",
    "#                 \"backdropPaths\": movie_data[\"backdropPaths\"],\n",
    "#                 \"plotSummary\": movie_data[\"plotSummary\"],\n",
    "#                 \"releaseDate\": movie_data[\"releaseDate\"],\n",
    "#                 \"youtubeTrailerIds\": movie_data.get(\"youtubeTrailerIds\", []),\n",
    "#                 \"actors\": movie_data.get(\"actors\", []),  # Récupère les acteurs\n",
    "#                 \"directors\": movie_data.get(\"directors\", [])  # Récupère les réalisateurs\n",
    "#             }\n",
    "#         else:\n",
    "#             print(f\"Failed to fetch movie details for movie ID {movie_id}. Status code: {movie_response.status_code}\")\n",
    "#             return None\n",
    "#     else:\n",
    "#         print(f\"Failed to authenticate with MovieLens API. Status code: {response.status_code}\")\n",
    "#         return None\n",
    "\n",
    "# # Fonction principale pour lire les films par lots et mettre à jour Neo4j\n",
    "# def update_movies_with_api_details():\n",
    "#     batch_size = 1000\n",
    "#     page = 0\n",
    "#     print(\"Starting the movie update process...\")\n",
    "    \n",
    "#     while True:\n",
    "#         print(f\"Processing batch {page} of movies...\")\n",
    "#         movies = get_movies_from_neo4j(batch_size=batch_size, page=page)\n",
    "        \n",
    "#         if not movies:\n",
    "#             print(\"No more movies to process. Exiting...\")\n",
    "#             break  # Terminer quand il n'y a plus de films à traiter\n",
    "\n",
    "#         for movie_record in movies:\n",
    "#             movie_id = movie_record[\"movieId\"]\n",
    "            \n",
    "#             # Récupérer les détails du film depuis l'API\n",
    "#             movie_data = get_movie_details_from_movielens_api(movie_id)\n",
    "#             if movie_data:\n",
    "#                 # Mettre à jour le film dans Neo4j avec les champs spécifiques\n",
    "#                 create_or_update_movie_in_neo4j(movie_data)\n",
    "#                 # Créer les relations pour les acteurs et réalisateurs\n",
    "#                 create_actors_and_directors_in_neo4j(movie_id, movie_data[\"actors\"], movie_data[\"directors\"])\n",
    "#             else:\n",
    "#                 print(f\"Details not found or failed for movie ID {movie_id}\")\n",
    "        \n",
    "#         page += 1\n",
    "#         print(f\"Batch {page} processed.\")\n",
    "\n",
    "# # Exécuter la mise à jour des films\n",
    "# print(\"Starting movie update process...\")\n",
    "# update_movies_with_api_details()\n",
    "\n",
    "# # Fermer la connexion Neo4j\n",
    "# driver.close()\n",
    "# print(\"Neo4j connection closed.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Starting process to generate CSVs...\n",
      "Fetching all movies from MovieLens API...\n",
      "Authenticated successfully with MovieLens API.\n",
      "Fetched page 2 with 24 movies.\n",
      "Fetched page 3 with 24 movies.\n",
      "Fetched page 4 with 24 movies.\n",
      "Fetched page 5 with 24 movies.\n",
      "Fetched page 6 with 24 movies.\n",
      "Fetched page 7 with 24 movies.\n",
      "Fetched page 8 with 24 movies.\n",
      "Fetched page 9 with 24 movies.\n",
      "Fetched page 10 with 24 movies.\n",
      "Fetched page 11 with 24 movies.\n",
      "Fetched page 12 with 24 movies.\n",
      "Fetched page 13 with 24 movies.\n",
      "Fetched page 14 with 24 movies.\n",
      "Fetched page 15 with 24 movies.\n",
      "Fetched page 16 with 24 movies.\n",
      "Fetched page 17 with 24 movies.\n",
      "Fetched page 18 with 24 movies.\n",
      "Fetched page 19 with 24 movies.\n",
      "Fetched page 20 with 24 movies.\n",
      "Fetched page 21 with 24 movies.\n",
      "Fetched page 22 with 24 movies.\n",
      "Fetched page 23 with 24 movies.\n",
      "Fetched page 24 with 24 movies.\n",
      "Fetched page 25 with 24 movies.\n",
      "Fetched page 26 with 24 movies.\n",
      "Fetched page 27 with 24 movies.\n",
      "Fetched page 28 with 24 movies.\n",
      "Fetched page 29 with 24 movies.\n",
      "Fetched page 30 with 24 movies.\n",
      "Fetched page 31 with 24 movies.\n",
      "Fetched page 32 with 24 movies.\n",
      "Fetched page 33 with 24 movies.\n",
      "Fetched page 34 with 24 movies.\n",
      "Fetched page 35 with 24 movies.\n",
      "Fetched page 36 with 24 movies.\n",
      "Fetched page 37 with 24 movies.\n",
      "Fetched page 38 with 24 movies.\n",
      "Fetched page 39 with 24 movies.\n",
      "Fetched page 40 with 24 movies.\n",
      "Fetched page 41 with 24 movies.\n",
      "Fetched page 42 with 24 movies.\n",
      "Fetched page 43 with 24 movies.\n",
      "Fetched page 44 with 24 movies.\n",
      "Fetched page 45 with 24 movies.\n",
      "Fetched page 46 with 24 movies.\n",
      "Fetched page 47 with 24 movies.\n",
      "Fetched page 48 with 24 movies.\n",
      "Fetched page 49 with 24 movies.\n",
      "Fetched page 50 with 24 movies.\n",
      "Fetched page 51 with 24 movies.\n",
      "Fetched page 52 with 24 movies.\n",
      "Fetched page 53 with 24 movies.\n",
      "Fetched page 54 with 24 movies.\n",
      "Fetched page 55 with 24 movies.\n",
      "Fetched page 56 with 24 movies.\n",
      "Fetched page 57 with 24 movies.\n",
      "Fetched page 58 with 24 movies.\n",
      "Fetched page 59 with 24 movies.\n",
      "Fetched page 60 with 24 movies.\n",
      "Fetched page 61 with 24 movies.\n",
      "Fetched page 62 with 24 movies.\n",
      "Fetched page 63 with 24 movies.\n",
      "Fetched page 64 with 24 movies.\n",
      "Fetched page 65 with 24 movies.\n",
      "Fetched page 66 with 24 movies.\n",
      "Fetched page 67 with 24 movies.\n",
      "Fetched page 68 with 24 movies.\n",
      "Fetched page 69 with 24 movies.\n",
      "Fetched page 70 with 24 movies.\n",
      "Fetched page 71 with 24 movies.\n",
      "Fetched page 72 with 24 movies.\n",
      "Fetched page 73 with 24 movies.\n",
      "Fetched page 74 with 24 movies.\n",
      "Fetched page 75 with 24 movies.\n",
      "Fetched page 76 with 24 movies.\n",
      "Fetched page 77 with 24 movies.\n",
      "Fetched page 78 with 24 movies.\n",
      "Fetched page 79 with 24 movies.\n",
      "Fetched page 80 with 24 movies.\n",
      "Fetched page 81 with 24 movies.\n",
      "Fetched page 82 with 24 movies.\n",
      "Fetched page 83 with 24 movies.\n",
      "Fetched page 84 with 24 movies.\n",
      "Fetched page 85 with 24 movies.\n",
      "Fetched page 86 with 24 movies.\n",
      "Fetched page 87 with 24 movies.\n",
      "Fetched page 88 with 24 movies.\n",
      "Fetched page 89 with 24 movies.\n",
      "Fetched page 90 with 24 movies.\n",
      "Fetched page 91 with 24 movies.\n",
      "Fetched page 92 with 24 movies.\n",
      "Fetched page 93 with 24 movies.\n",
      "Fetched page 94 with 24 movies.\n",
      "Fetched page 95 with 24 movies.\n",
      "Fetched page 96 with 24 movies.\n",
      "Fetched page 97 with 24 movies.\n",
      "Fetched page 98 with 24 movies.\n",
      "Fetched page 99 with 24 movies.\n",
      "Fetched page 100 with 24 movies.\n",
      "Fetched page 101 with 24 movies.\n",
      "Fetched page 102 with 24 movies.\n",
      "Fetched page 103 with 24 movies.\n",
      "Fetched page 104 with 24 movies.\n",
      "Fetched page 105 with 24 movies.\n",
      "Fetched page 106 with 24 movies.\n",
      "Fetched page 107 with 24 movies.\n",
      "Fetched page 108 with 24 movies.\n",
      "Fetched page 109 with 24 movies.\n",
      "Fetched page 110 with 24 movies.\n",
      "Fetched page 111 with 24 movies.\n",
      "Fetched page 112 with 24 movies.\n",
      "Fetched page 113 with 24 movies.\n",
      "Fetched page 114 with 24 movies.\n",
      "Fetched page 115 with 24 movies.\n",
      "Fetched page 116 with 24 movies.\n",
      "Fetched page 117 with 24 movies.\n",
      "Fetched page 118 with 24 movies.\n",
      "Fetched page 119 with 24 movies.\n",
      "Fetched page 120 with 24 movies.\n",
      "Fetched page 121 with 24 movies.\n",
      "Fetched page 122 with 24 movies.\n",
      "Fetched page 123 with 24 movies.\n",
      "Fetched page 124 with 24 movies.\n",
      "Fetched page 125 with 24 movies.\n",
      "Fetched page 126 with 24 movies.\n",
      "Fetched page 127 with 24 movies.\n",
      "Fetched page 128 with 24 movies.\n",
      "Fetched page 129 with 24 movies.\n",
      "Fetched page 130 with 24 movies.\n",
      "Fetched page 131 with 24 movies.\n",
      "Fetched page 132 with 24 movies.\n",
      "Fetched page 133 with 24 movies.\n",
      "Fetched page 134 with 24 movies.\n",
      "Fetched page 135 with 24 movies.\n",
      "Fetched page 136 with 24 movies.\n",
      "Fetched page 137 with 24 movies.\n",
      "Fetched page 138 with 24 movies.\n",
      "Fetched page 139 with 24 movies.\n",
      "Fetched page 140 with 24 movies.\n",
      "Fetched page 141 with 24 movies.\n",
      "Fetched page 142 with 24 movies.\n",
      "Fetched page 143 with 24 movies.\n",
      "Fetched page 144 with 24 movies.\n",
      "Fetched page 145 with 24 movies.\n",
      "Fetched page 146 with 24 movies.\n",
      "Fetched page 147 with 24 movies.\n",
      "Fetched page 148 with 24 movies.\n",
      "Fetched page 149 with 24 movies.\n",
      "Fetched page 150 with 24 movies.\n",
      "Fetched page 151 with 24 movies.\n",
      "Fetched page 152 with 24 movies.\n",
      "Fetched page 153 with 24 movies.\n",
      "Fetched page 154 with 24 movies.\n",
      "Fetched page 155 with 24 movies.\n",
      "Fetched page 156 with 24 movies.\n",
      "Fetched page 157 with 24 movies.\n",
      "Fetched page 158 with 24 movies.\n",
      "Fetched page 159 with 24 movies.\n",
      "Fetched page 160 with 24 movies.\n",
      "Fetched page 161 with 24 movies.\n",
      "Fetched page 162 with 24 movies.\n",
      "Fetched page 163 with 24 movies.\n",
      "Fetched page 164 with 24 movies.\n",
      "Fetched page 165 with 24 movies.\n",
      "Fetched page 166 with 24 movies.\n",
      "Fetched page 167 with 24 movies.\n",
      "Fetched page 168 with 24 movies.\n",
      "Fetched page 169 with 24 movies.\n",
      "Fetched page 170 with 24 movies.\n",
      "Fetched page 171 with 24 movies.\n",
      "Fetched page 172 with 24 movies.\n",
      "Fetched page 173 with 24 movies.\n",
      "Fetched page 174 with 24 movies.\n",
      "Fetched page 175 with 24 movies.\n",
      "Fetched page 176 with 24 movies.\n",
      "Fetched page 177 with 24 movies.\n",
      "Fetched page 178 with 24 movies.\n",
      "Fetched page 179 with 24 movies.\n",
      "Fetched page 180 with 24 movies.\n",
      "Fetched page 181 with 24 movies.\n",
      "Fetched page 182 with 24 movies.\n",
      "Fetched page 183 with 24 movies.\n",
      "Fetched page 184 with 24 movies.\n",
      "Fetched page 185 with 24 movies.\n",
      "Fetched page 186 with 24 movies.\n",
      "Fetched page 187 with 24 movies.\n",
      "Fetched page 188 with 24 movies.\n",
      "Fetched page 189 with 24 movies.\n",
      "Fetched page 190 with 24 movies.\n",
      "Fetched page 191 with 24 movies.\n",
      "Fetched page 192 with 24 movies.\n",
      "Fetched page 193 with 24 movies.\n",
      "Fetched page 194 with 24 movies.\n",
      "Fetched page 195 with 24 movies.\n",
      "Fetched page 196 with 24 movies.\n",
      "Fetched page 197 with 24 movies.\n",
      "Fetched page 198 with 24 movies.\n",
      "Fetched page 199 with 24 movies.\n",
      "Fetched page 200 with 24 movies.\n",
      "Fetched page 201 with 24 movies.\n",
      "Fetched page 202 with 24 movies.\n",
      "Fetched page 203 with 24 movies.\n",
      "Fetched page 204 with 24 movies.\n",
      "Fetched page 205 with 24 movies.\n",
      "Fetched page 206 with 24 movies.\n",
      "Fetched page 207 with 24 movies.\n",
      "Fetched page 208 with 24 movies.\n",
      "Fetched page 209 with 24 movies.\n",
      "Fetched page 210 with 24 movies.\n",
      "Fetched page 211 with 24 movies.\n",
      "Fetched page 212 with 24 movies.\n",
      "Fetched page 213 with 24 movies.\n",
      "Fetched page 214 with 24 movies.\n",
      "Fetched page 215 with 24 movies.\n",
      "Fetched page 216 with 24 movies.\n",
      "Fetched page 217 with 24 movies.\n",
      "Fetched page 218 with 24 movies.\n",
      "Fetched page 219 with 24 movies.\n",
      "Fetched page 220 with 24 movies.\n",
      "Fetched page 221 with 24 movies.\n",
      "Fetched page 222 with 24 movies.\n",
      "Fetched page 223 with 24 movies.\n",
      "Fetched page 224 with 24 movies.\n",
      "Fetched page 225 with 24 movies.\n",
      "Fetched page 226 with 24 movies.\n",
      "Fetched page 227 with 24 movies.\n",
      "Fetched page 228 with 24 movies.\n",
      "Fetched page 229 with 24 movies.\n",
      "Fetched page 230 with 24 movies.\n",
      "Fetched page 231 with 24 movies.\n",
      "Fetched page 232 with 24 movies.\n",
      "Fetched page 233 with 24 movies.\n",
      "Fetched page 234 with 24 movies.\n",
      "Fetched page 235 with 24 movies.\n",
      "Fetched page 236 with 24 movies.\n",
      "Fetched page 237 with 24 movies.\n",
      "Fetched page 238 with 24 movies.\n",
      "Fetched page 239 with 24 movies.\n",
      "Fetched page 240 with 24 movies.\n",
      "Fetched page 241 with 24 movies.\n",
      "Fetched page 242 with 24 movies.\n",
      "Fetched page 243 with 24 movies.\n",
      "Fetched page 244 with 24 movies.\n",
      "Fetched page 245 with 24 movies.\n",
      "Fetched page 246 with 24 movies.\n",
      "Fetched page 247 with 24 movies.\n",
      "Fetched page 248 with 24 movies.\n",
      "Fetched page 249 with 24 movies.\n",
      "Fetched page 250 with 24 movies.\n",
      "Fetched page 251 with 24 movies.\n",
      "Fetched page 252 with 24 movies.\n",
      "Fetched page 253 with 24 movies.\n",
      "Fetched page 254 with 24 movies.\n",
      "Fetched page 255 with 24 movies.\n",
      "Fetched page 256 with 24 movies.\n",
      "Fetched page 257 with 24 movies.\n",
      "Fetched page 258 with 24 movies.\n",
      "Fetched page 259 with 24 movies.\n",
      "Fetched page 260 with 24 movies.\n",
      "Fetched page 261 with 24 movies.\n",
      "Fetched page 262 with 24 movies.\n",
      "Fetched page 263 with 24 movies.\n",
      "Fetched page 264 with 24 movies.\n",
      "Fetched page 265 with 24 movies.\n",
      "Fetched page 266 with 24 movies.\n",
      "Fetched page 267 with 24 movies.\n",
      "Fetched page 268 with 24 movies.\n",
      "Fetched page 269 with 24 movies.\n",
      "Fetched page 270 with 24 movies.\n",
      "Fetched page 271 with 24 movies.\n",
      "Fetched page 272 with 24 movies.\n",
      "Fetched page 273 with 24 movies.\n",
      "Fetched page 274 with 24 movies.\n",
      "Fetched page 275 with 24 movies.\n",
      "Fetched page 276 with 24 movies.\n",
      "Fetched page 277 with 24 movies.\n",
      "Fetched page 278 with 24 movies.\n",
      "Fetched page 279 with 24 movies.\n",
      "Fetched page 280 with 24 movies.\n",
      "Fetched page 281 with 24 movies.\n",
      "Fetched page 282 with 24 movies.\n",
      "Fetched page 283 with 24 movies.\n",
      "Fetched page 284 with 24 movies.\n",
      "Fetched page 285 with 24 movies.\n",
      "Fetched page 286 with 24 movies.\n",
      "Fetched page 287 with 24 movies.\n",
      "Fetched page 288 with 24 movies.\n",
      "Fetched page 289 with 24 movies.\n",
      "Fetched page 290 with 24 movies.\n",
      "Fetched page 291 with 24 movies.\n",
      "Fetched page 292 with 24 movies.\n",
      "Fetched page 293 with 24 movies.\n",
      "Fetched page 294 with 24 movies.\n",
      "Fetched page 295 with 24 movies.\n",
      "Fetched page 296 with 24 movies.\n",
      "Fetched page 297 with 24 movies.\n",
      "Fetched page 298 with 24 movies.\n",
      "Fetched page 299 with 24 movies.\n",
      "Fetched page 300 with 24 movies.\n",
      "Fetched page 301 with 24 movies.\n",
      "Fetched page 302 with 24 movies.\n",
      "Fetched page 303 with 24 movies.\n",
      "Fetched page 304 with 24 movies.\n",
      "Fetched page 305 with 24 movies.\n",
      "Fetched page 306 with 24 movies.\n",
      "Fetched page 307 with 24 movies.\n",
      "Fetched page 308 with 24 movies.\n",
      "Fetched page 309 with 24 movies.\n",
      "Fetched page 310 with 24 movies.\n",
      "Fetched page 311 with 24 movies.\n",
      "Fetched page 312 with 24 movies.\n",
      "Fetched page 313 with 24 movies.\n",
      "Fetched page 314 with 24 movies.\n",
      "Fetched page 315 with 24 movies.\n",
      "Fetched page 316 with 24 movies.\n",
      "Fetched page 317 with 24 movies.\n",
      "Fetched page 318 with 24 movies.\n",
      "Fetched page 319 with 24 movies.\n",
      "Fetched page 320 with 24 movies.\n",
      "Fetched page 321 with 24 movies.\n",
      "Fetched page 322 with 24 movies.\n",
      "Fetched page 323 with 24 movies.\n",
      "Fetched page 324 with 24 movies.\n",
      "Fetched page 325 with 24 movies.\n",
      "Fetched page 326 with 24 movies.\n",
      "Fetched page 327 with 24 movies.\n",
      "Fetched page 328 with 24 movies.\n",
      "Fetched page 329 with 24 movies.\n",
      "Fetched page 330 with 24 movies.\n",
      "Fetched page 331 with 24 movies.\n",
      "Fetched page 332 with 24 movies.\n",
      "Fetched page 333 with 24 movies.\n",
      "Fetched page 334 with 24 movies.\n",
      "Fetched page 335 with 24 movies.\n",
      "Fetched page 336 with 24 movies.\n",
      "Fetched page 337 with 24 movies.\n",
      "Fetched page 338 with 24 movies.\n",
      "Fetched page 339 with 24 movies.\n",
      "Fetched page 340 with 24 movies.\n",
      "Fetched page 341 with 24 movies.\n",
      "Fetched page 342 with 24 movies.\n",
      "Fetched page 343 with 24 movies.\n",
      "Fetched page 344 with 24 movies.\n",
      "Fetched page 345 with 24 movies.\n",
      "Fetched page 346 with 24 movies.\n",
      "Fetched page 347 with 24 movies.\n",
      "Fetched page 348 with 24 movies.\n",
      "Fetched page 349 with 24 movies.\n",
      "Fetched page 350 with 24 movies.\n",
      "Fetched page 351 with 24 movies.\n",
      "Fetched page 352 with 24 movies.\n",
      "Fetched page 353 with 24 movies.\n",
      "Fetched page 354 with 24 movies.\n",
      "Fetched page 355 with 24 movies.\n",
      "Fetched page 356 with 24 movies.\n",
      "Fetched page 357 with 24 movies.\n",
      "Fetched page 358 with 24 movies.\n",
      "Fetched page 359 with 24 movies.\n",
      "Fetched page 360 with 24 movies.\n",
      "Fetched page 361 with 24 movies.\n",
      "Fetched page 362 with 24 movies.\n",
      "Fetched page 363 with 24 movies.\n",
      "Fetched page 364 with 24 movies.\n",
      "Fetched page 365 with 24 movies.\n",
      "Fetched page 366 with 24 movies.\n",
      "Fetched page 367 with 24 movies.\n",
      "Fetched page 368 with 24 movies.\n",
      "Fetched page 369 with 24 movies.\n",
      "Fetched page 370 with 24 movies.\n",
      "Fetched page 371 with 24 movies.\n",
      "Fetched page 372 with 24 movies.\n",
      "Fetched page 373 with 24 movies.\n",
      "Fetched page 374 with 24 movies.\n",
      "Fetched page 375 with 24 movies.\n",
      "Fetched page 376 with 24 movies.\n",
      "Fetched page 377 with 24 movies.\n",
      "Fetched page 378 with 24 movies.\n",
      "Fetched page 379 with 24 movies.\n",
      "Fetched page 380 with 24 movies.\n",
      "Fetched page 381 with 24 movies.\n",
      "Fetched page 382 with 24 movies.\n",
      "Fetched page 383 with 24 movies.\n",
      "Fetched page 384 with 24 movies.\n",
      "Fetched page 385 with 24 movies.\n",
      "Fetched page 386 with 24 movies.\n",
      "Fetched page 387 with 24 movies.\n",
      "Fetched page 388 with 24 movies.\n",
      "Fetched page 389 with 24 movies.\n",
      "Fetched page 390 with 24 movies.\n",
      "Fetched page 391 with 24 movies.\n",
      "Fetched page 392 with 24 movies.\n",
      "Fetched page 393 with 24 movies.\n",
      "Fetched page 394 with 24 movies.\n",
      "Fetched page 395 with 24 movies.\n",
      "Fetched page 396 with 24 movies.\n",
      "Fetched page 397 with 24 movies.\n",
      "Fetched page 398 with 24 movies.\n",
      "Fetched page 399 with 24 movies.\n",
      "Fetched page 400 with 24 movies.\n",
      "Fetched page 401 with 24 movies.\n",
      "Fetched page 402 with 24 movies.\n",
      "Fetched page 403 with 24 movies.\n",
      "Fetched page 404 with 24 movies.\n",
      "Fetched page 405 with 24 movies.\n",
      "Fetched page 406 with 24 movies.\n",
      "Fetched page 407 with 24 movies.\n",
      "Fetched page 408 with 24 movies.\n",
      "Fetched page 409 with 24 movies.\n",
      "Fetched page 410 with 24 movies.\n",
      "Fetched page 411 with 24 movies.\n",
      "Fetched page 412 with 24 movies.\n",
      "Fetched page 413 with 24 movies.\n",
      "Fetched page 414 with 24 movies.\n",
      "Fetched page 415 with 24 movies.\n",
      "Fetched page 416 with 24 movies.\n",
      "Fetched page 417 with 24 movies.\n",
      "Fetched page 418 with 24 movies.\n",
      "Fetched page 419 with 24 movies.\n",
      "Fetched page 420 with 24 movies.\n",
      "Fetched page 421 with 24 movies.\n",
      "Fetched page 422 with 24 movies.\n",
      "Fetched page 423 with 24 movies.\n",
      "Fetched page 424 with 24 movies.\n",
      "Fetched page 425 with 24 movies.\n",
      "Fetched page 426 with 24 movies.\n",
      "Fetched page 427 with 24 movies.\n",
      "Fetched page 428 with 24 movies.\n",
      "Fetched page 429 with 24 movies.\n",
      "Fetched page 430 with 24 movies.\n",
      "Fetched page 431 with 24 movies.\n",
      "Fetched page 432 with 24 movies.\n",
      "Fetched page 433 with 24 movies.\n",
      "Fetched page 434 with 24 movies.\n",
      "Fetched page 435 with 24 movies.\n",
      "Fetched page 436 with 24 movies.\n",
      "Fetched page 437 with 24 movies.\n",
      "Fetched page 438 with 24 movies.\n",
      "Fetched page 439 with 24 movies.\n",
      "Fetched page 440 with 24 movies.\n",
      "Fetched page 441 with 24 movies.\n",
      "Fetched page 442 with 24 movies.\n",
      "Fetched page 443 with 24 movies.\n",
      "Fetched page 444 with 24 movies.\n",
      "Fetched page 445 with 24 movies.\n",
      "Fetched page 446 with 24 movies.\n",
      "Fetched page 447 with 24 movies.\n",
      "Fetched page 448 with 24 movies.\n",
      "Fetched page 449 with 24 movies.\n",
      "Fetched page 450 with 24 movies.\n",
      "Fetched page 451 with 24 movies.\n",
      "Fetched page 452 with 24 movies.\n",
      "Fetched page 453 with 24 movies.\n",
      "Fetched page 454 with 24 movies.\n",
      "Fetched page 455 with 24 movies.\n",
      "Fetched page 456 with 24 movies.\n",
      "Fetched page 457 with 24 movies.\n",
      "Fetched page 458 with 24 movies.\n",
      "Fetched page 459 with 24 movies.\n",
      "Fetched page 460 with 24 movies.\n",
      "Fetched page 461 with 24 movies.\n",
      "Fetched page 462 with 24 movies.\n",
      "Fetched page 463 with 24 movies.\n",
      "Fetched page 464 with 24 movies.\n",
      "Fetched page 465 with 24 movies.\n",
      "Fetched page 466 with 24 movies.\n",
      "Fetched page 467 with 24 movies.\n",
      "Fetched page 468 with 24 movies.\n",
      "Fetched page 469 with 24 movies.\n",
      "Fetched page 470 with 24 movies.\n",
      "Fetched page 471 with 24 movies.\n",
      "Fetched page 472 with 24 movies.\n",
      "Fetched page 473 with 24 movies.\n",
      "Fetched page 474 with 24 movies.\n",
      "Fetched page 475 with 24 movies.\n",
      "Fetched page 476 with 24 movies.\n",
      "Fetched page 477 with 24 movies.\n",
      "Fetched page 478 with 24 movies.\n",
      "Fetched page 479 with 24 movies.\n",
      "Fetched page 480 with 24 movies.\n",
      "Fetched page 481 with 24 movies.\n",
      "Fetched page 482 with 24 movies.\n",
      "Fetched page 483 with 24 movies.\n",
      "Fetched page 484 with 24 movies.\n",
      "Fetched page 485 with 24 movies.\n",
      "Fetched page 486 with 24 movies.\n",
      "Fetched page 487 with 24 movies.\n",
      "Fetched page 488 with 24 movies.\n",
      "Fetched page 489 with 24 movies.\n",
      "Fetched page 490 with 24 movies.\n",
      "Fetched page 491 with 24 movies.\n",
      "Fetched page 492 with 24 movies.\n",
      "Fetched page 493 with 24 movies.\n",
      "Fetched page 494 with 24 movies.\n",
      "Fetched page 495 with 24 movies.\n",
      "Fetched page 496 with 24 movies.\n",
      "Fetched page 497 with 24 movies.\n",
      "Fetched page 498 with 24 movies.\n",
      "Fetched page 499 with 24 movies.\n",
      "Fetched page 500 with 24 movies.\n",
      "Fetched page 501 with 24 movies.\n",
      "Fetched page 502 with 24 movies.\n",
      "Fetched page 503 with 24 movies.\n",
      "Fetched page 504 with 24 movies.\n",
      "Fetched page 505 with 24 movies.\n",
      "Fetched page 506 with 24 movies.\n",
      "Fetched page 507 with 24 movies.\n",
      "Fetched page 508 with 24 movies.\n",
      "Fetched page 509 with 24 movies.\n",
      "Fetched page 510 with 24 movies.\n",
      "Fetched page 511 with 24 movies.\n",
      "Fetched page 512 with 24 movies.\n",
      "Fetched page 513 with 24 movies.\n",
      "Fetched page 514 with 24 movies.\n",
      "Fetched page 515 with 24 movies.\n",
      "Fetched page 516 with 24 movies.\n",
      "Fetched page 517 with 24 movies.\n",
      "Fetched page 518 with 24 movies.\n",
      "Fetched page 519 with 24 movies.\n",
      "Fetched page 520 with 24 movies.\n",
      "Fetched page 521 with 24 movies.\n",
      "Fetched page 522 with 24 movies.\n",
      "Fetched page 523 with 24 movies.\n",
      "Fetched page 524 with 24 movies.\n",
      "Fetched page 525 with 24 movies.\n",
      "Fetched page 526 with 24 movies.\n",
      "Fetched page 527 with 24 movies.\n",
      "Fetched page 528 with 24 movies.\n",
      "Fetched page 529 with 24 movies.\n",
      "Fetched page 530 with 24 movies.\n",
      "Fetched page 531 with 24 movies.\n",
      "Fetched page 532 with 24 movies.\n",
      "Fetched page 533 with 24 movies.\n",
      "Fetched page 534 with 24 movies.\n",
      "Fetched page 535 with 24 movies.\n",
      "Fetched page 536 with 24 movies.\n",
      "Fetched page 537 with 24 movies.\n",
      "Fetched page 538 with 24 movies.\n",
      "Fetched page 539 with 24 movies.\n",
      "Fetched page 540 with 24 movies.\n",
      "Fetched page 541 with 24 movies.\n",
      "Fetched page 542 with 24 movies.\n",
      "Fetched page 543 with 24 movies.\n",
      "Fetched page 544 with 24 movies.\n",
      "Fetched page 545 with 24 movies.\n",
      "Fetched page 546 with 24 movies.\n",
      "Fetched page 547 with 24 movies.\n",
      "Fetched page 548 with 24 movies.\n",
      "Fetched page 549 with 24 movies.\n",
      "Fetched page 550 with 24 movies.\n",
      "Fetched page 551 with 24 movies.\n",
      "Fetched page 552 with 24 movies.\n",
      "Fetched page 553 with 24 movies.\n",
      "Fetched page 554 with 24 movies.\n",
      "Fetched page 555 with 24 movies.\n",
      "Fetched page 556 with 24 movies.\n",
      "Fetched page 557 with 24 movies.\n",
      "Fetched page 558 with 24 movies.\n",
      "Fetched page 559 with 24 movies.\n",
      "Fetched page 560 with 24 movies.\n",
      "Fetched page 561 with 24 movies.\n",
      "Fetched page 562 with 24 movies.\n",
      "Fetched page 563 with 24 movies.\n",
      "Fetched page 564 with 24 movies.\n",
      "Fetched page 565 with 24 movies.\n",
      "Fetched page 566 with 24 movies.\n",
      "Fetched page 567 with 24 movies.\n",
      "Fetched page 568 with 24 movies.\n",
      "Fetched page 569 with 24 movies.\n",
      "Fetched page 570 with 24 movies.\n",
      "Fetched page 571 with 24 movies.\n",
      "Fetched page 572 with 24 movies.\n",
      "Fetched page 573 with 24 movies.\n",
      "Fetched page 574 with 24 movies.\n",
      "Fetched page 575 with 24 movies.\n",
      "Fetched page 576 with 24 movies.\n",
      "Fetched page 577 with 24 movies.\n",
      "Fetched page 578 with 24 movies.\n",
      "Fetched page 579 with 24 movies.\n",
      "Fetched page 580 with 24 movies.\n",
      "Fetched page 581 with 24 movies.\n",
      "Fetched page 582 with 24 movies.\n",
      "Fetched page 583 with 24 movies.\n",
      "Fetched page 584 with 24 movies.\n",
      "Fetched page 585 with 24 movies.\n",
      "Fetched page 586 with 24 movies.\n",
      "Fetched page 587 with 24 movies.\n",
      "Fetched page 588 with 24 movies.\n",
      "Fetched page 589 with 24 movies.\n",
      "Fetched page 590 with 24 movies.\n",
      "Fetched page 591 with 24 movies.\n",
      "Fetched page 592 with 24 movies.\n",
      "Fetched page 593 with 24 movies.\n",
      "Fetched page 594 with 24 movies.\n",
      "Fetched page 595 with 24 movies.\n",
      "Fetched page 596 with 24 movies.\n",
      "Fetched page 597 with 24 movies.\n",
      "Fetched page 598 with 24 movies.\n",
      "Fetched page 599 with 24 movies.\n",
      "Fetched page 600 with 24 movies.\n",
      "Fetched page 601 with 24 movies.\n",
      "Fetched page 602 with 24 movies.\n",
      "Fetched page 603 with 24 movies.\n",
      "Fetched page 604 with 24 movies.\n",
      "Fetched page 605 with 24 movies.\n",
      "Fetched page 606 with 24 movies.\n",
      "Fetched page 607 with 24 movies.\n",
      "Fetched page 608 with 24 movies.\n",
      "Fetched page 609 with 24 movies.\n",
      "Fetched page 610 with 24 movies.\n",
      "Fetched page 611 with 24 movies.\n",
      "Fetched page 612 with 24 movies.\n",
      "Fetched page 613 with 24 movies.\n",
      "Fetched page 614 with 24 movies.\n",
      "Fetched page 615 with 24 movies.\n",
      "Fetched page 616 with 24 movies.\n",
      "Fetched page 617 with 24 movies.\n",
      "Fetched page 618 with 24 movies.\n",
      "Fetched page 619 with 24 movies.\n",
      "Fetched page 620 with 24 movies.\n",
      "Fetched page 621 with 24 movies.\n",
      "Fetched page 622 with 24 movies.\n",
      "Fetched page 623 with 24 movies.\n",
      "Fetched page 624 with 24 movies.\n",
      "Fetched page 625 with 24 movies.\n",
      "Fetched page 626 with 24 movies.\n",
      "Fetched page 627 with 24 movies.\n",
      "Fetched page 628 with 24 movies.\n",
      "Fetched page 629 with 24 movies.\n",
      "Fetched page 630 with 24 movies.\n",
      "Fetched page 631 with 24 movies.\n",
      "Fetched page 632 with 24 movies.\n",
      "Fetched page 633 with 24 movies.\n",
      "Fetched page 634 with 24 movies.\n",
      "Fetched page 635 with 24 movies.\n",
      "Fetched page 636 with 24 movies.\n",
      "Fetched page 637 with 24 movies.\n",
      "Fetched page 638 with 24 movies.\n",
      "Fetched page 639 with 24 movies.\n",
      "Fetched page 640 with 24 movies.\n",
      "Fetched page 641 with 24 movies.\n",
      "Fetched page 642 with 24 movies.\n",
      "Fetched page 643 with 24 movies.\n",
      "Fetched page 644 with 24 movies.\n",
      "Fetched page 645 with 24 movies.\n",
      "Fetched page 646 with 24 movies.\n",
      "Fetched page 647 with 24 movies.\n",
      "Fetched page 648 with 24 movies.\n",
      "Fetched page 649 with 24 movies.\n",
      "Fetched page 650 with 24 movies.\n",
      "Fetched page 651 with 24 movies.\n",
      "Fetched page 652 with 24 movies.\n",
      "Fetched page 653 with 24 movies.\n",
      "Fetched page 654 with 24 movies.\n",
      "Fetched page 655 with 24 movies.\n",
      "Fetched page 656 with 24 movies.\n",
      "Fetched page 657 with 24 movies.\n",
      "Fetched page 658 with 24 movies.\n",
      "Fetched page 659 with 24 movies.\n",
      "Fetched page 660 with 24 movies.\n",
      "Fetched page 661 with 24 movies.\n",
      "Fetched page 662 with 24 movies.\n",
      "Fetched page 663 with 24 movies.\n",
      "Fetched page 664 with 24 movies.\n",
      "Fetched page 665 with 24 movies.\n",
      "Fetched page 666 with 24 movies.\n",
      "Fetched page 667 with 24 movies.\n",
      "Fetched page 668 with 24 movies.\n",
      "Fetched page 669 with 24 movies.\n",
      "Fetched page 670 with 24 movies.\n",
      "Fetched page 671 with 24 movies.\n",
      "Fetched page 672 with 24 movies.\n",
      "Fetched page 673 with 24 movies.\n",
      "Fetched page 674 with 24 movies.\n",
      "Fetched page 675 with 24 movies.\n",
      "Fetched page 676 with 24 movies.\n",
      "Fetched page 677 with 24 movies.\n",
      "Fetched page 678 with 24 movies.\n",
      "Fetched page 679 with 24 movies.\n",
      "Fetched page 680 with 24 movies.\n",
      "Fetched page 681 with 24 movies.\n",
      "Fetched page 682 with 24 movies.\n",
      "Fetched page 683 with 24 movies.\n",
      "Fetched page 684 with 24 movies.\n",
      "Fetched page 685 with 24 movies.\n",
      "Fetched page 686 with 24 movies.\n",
      "Fetched page 687 with 24 movies.\n",
      "Fetched page 688 with 24 movies.\n",
      "Fetched page 689 with 24 movies.\n",
      "Fetched page 690 with 24 movies.\n",
      "Fetched page 691 with 24 movies.\n",
      "Fetched page 692 with 24 movies.\n",
      "Fetched page 693 with 24 movies.\n",
      "Fetched page 694 with 24 movies.\n",
      "Fetched page 695 with 24 movies.\n",
      "Fetched page 696 with 24 movies.\n",
      "Fetched page 697 with 24 movies.\n",
      "Fetched page 698 with 24 movies.\n",
      "Fetched page 699 with 24 movies.\n",
      "Fetched page 700 with 24 movies.\n",
      "Fetched page 701 with 24 movies.\n",
      "Fetched page 702 with 24 movies.\n",
      "Fetched page 703 with 24 movies.\n",
      "Fetched page 704 with 24 movies.\n",
      "Fetched page 705 with 24 movies.\n",
      "Fetched page 706 with 24 movies.\n",
      "Fetched page 707 with 24 movies.\n",
      "Fetched page 708 with 24 movies.\n",
      "Fetched page 709 with 24 movies.\n",
      "Fetched page 710 with 24 movies.\n",
      "Fetched page 711 with 24 movies.\n",
      "Fetched page 712 with 24 movies.\n",
      "Fetched page 713 with 24 movies.\n",
      "Fetched page 714 with 24 movies.\n",
      "Fetched page 715 with 24 movies.\n",
      "Fetched page 716 with 24 movies.\n",
      "Fetched page 717 with 24 movies.\n",
      "Fetched page 718 with 24 movies.\n",
      "Fetched page 719 with 24 movies.\n",
      "Fetched page 720 with 24 movies.\n",
      "Fetched page 721 with 24 movies.\n",
      "Fetched page 722 with 24 movies.\n",
      "Fetched page 723 with 24 movies.\n",
      "Fetched page 724 with 24 movies.\n",
      "Fetched page 725 with 24 movies.\n",
      "Fetched page 726 with 24 movies.\n",
      "Fetched page 727 with 24 movies.\n",
      "Fetched page 728 with 24 movies.\n",
      "Fetched page 729 with 24 movies.\n",
      "Fetched page 730 with 24 movies.\n",
      "Fetched page 731 with 24 movies.\n",
      "Fetched page 732 with 24 movies.\n",
      "Fetched page 733 with 24 movies.\n",
      "Fetched page 734 with 24 movies.\n",
      "Fetched page 735 with 24 movies.\n",
      "Fetched page 736 with 24 movies.\n",
      "Fetched page 737 with 24 movies.\n",
      "Fetched page 738 with 24 movies.\n",
      "Fetched page 739 with 24 movies.\n",
      "Fetched page 740 with 24 movies.\n",
      "Fetched page 741 with 24 movies.\n",
      "Fetched page 742 with 24 movies.\n",
      "Fetched page 743 with 24 movies.\n",
      "Fetched page 744 with 24 movies.\n",
      "Fetched page 745 with 24 movies.\n",
      "Fetched page 746 with 24 movies.\n",
      "Fetched page 747 with 24 movies.\n",
      "Fetched page 748 with 24 movies.\n",
      "Fetched page 749 with 24 movies.\n",
      "Fetched page 750 with 24 movies.\n",
      "Fetched page 751 with 24 movies.\n",
      "Fetched page 752 with 24 movies.\n",
      "Fetched page 753 with 24 movies.\n",
      "Fetched page 754 with 24 movies.\n",
      "Fetched page 755 with 24 movies.\n",
      "Fetched page 756 with 24 movies.\n",
      "Fetched page 757 with 24 movies.\n",
      "Fetched page 758 with 24 movies.\n",
      "Fetched page 759 with 24 movies.\n",
      "Fetched page 760 with 24 movies.\n",
      "Fetched page 761 with 24 movies.\n",
      "Fetched page 762 with 24 movies.\n",
      "Fetched page 763 with 24 movies.\n",
      "Fetched page 764 with 24 movies.\n",
      "Fetched page 765 with 24 movies.\n",
      "Fetched page 766 with 24 movies.\n",
      "Fetched page 767 with 24 movies.\n",
      "Fetched page 768 with 24 movies.\n",
      "Fetched page 769 with 24 movies.\n",
      "Fetched page 770 with 24 movies.\n",
      "Fetched page 771 with 24 movies.\n",
      "Fetched page 772 with 24 movies.\n",
      "Fetched page 773 with 24 movies.\n",
      "Fetched page 774 with 24 movies.\n",
      "Fetched page 775 with 24 movies.\n",
      "Fetched page 776 with 24 movies.\n",
      "Fetched page 777 with 24 movies.\n",
      "Fetched page 778 with 24 movies.\n",
      "Fetched page 779 with 24 movies.\n",
      "Fetched page 780 with 24 movies.\n",
      "Fetched page 781 with 24 movies.\n",
      "Fetched page 782 with 24 movies.\n",
      "Fetched page 783 with 24 movies.\n",
      "Fetched page 784 with 24 movies.\n",
      "Fetched page 785 with 24 movies.\n",
      "Fetched page 786 with 24 movies.\n",
      "Fetched page 787 with 24 movies.\n",
      "Fetched page 788 with 24 movies.\n",
      "Fetched page 789 with 24 movies.\n",
      "Fetched page 790 with 24 movies.\n",
      "Fetched page 791 with 24 movies.\n",
      "Fetched page 792 with 24 movies.\n",
      "Fetched page 793 with 24 movies.\n",
      "Fetched page 794 with 24 movies.\n",
      "Fetched page 795 with 24 movies.\n",
      "Fetched page 796 with 24 movies.\n",
      "Fetched page 797 with 24 movies.\n",
      "Fetched page 798 with 24 movies.\n",
      "Fetched page 799 with 24 movies.\n",
      "Fetched page 800 with 24 movies.\n",
      "Fetched page 801 with 24 movies.\n",
      "Fetched page 802 with 24 movies.\n",
      "Fetched page 803 with 24 movies.\n",
      "Fetched page 804 with 24 movies.\n",
      "Fetched page 805 with 24 movies.\n",
      "Fetched page 806 with 24 movies.\n",
      "Fetched page 807 with 24 movies.\n",
      "Fetched page 808 with 24 movies.\n",
      "Fetched page 809 with 24 movies.\n",
      "Fetched page 810 with 24 movies.\n",
      "Fetched page 811 with 24 movies.\n",
      "Fetched page 812 with 24 movies.\n",
      "Fetched page 813 with 24 movies.\n",
      "Fetched page 814 with 24 movies.\n",
      "Fetched page 815 with 24 movies.\n",
      "Fetched page 816 with 24 movies.\n",
      "Fetched page 817 with 24 movies.\n",
      "Fetched page 818 with 24 movies.\n",
      "Fetched page 819 with 24 movies.\n",
      "Fetched page 820 with 24 movies.\n",
      "Fetched page 821 with 24 movies.\n",
      "Fetched page 822 with 24 movies.\n",
      "Fetched page 823 with 24 movies.\n",
      "Fetched page 824 with 24 movies.\n",
      "Fetched page 825 with 24 movies.\n",
      "Fetched page 826 with 24 movies.\n",
      "Fetched page 827 with 24 movies.\n",
      "Fetched page 828 with 24 movies.\n",
      "Fetched page 829 with 24 movies.\n",
      "Fetched page 830 with 24 movies.\n",
      "Fetched page 831 with 24 movies.\n",
      "Fetched page 832 with 24 movies.\n",
      "Fetched page 833 with 24 movies.\n",
      "Fetched page 834 with 24 movies.\n",
      "Fetched page 835 with 24 movies.\n",
      "Fetched page 836 with 24 movies.\n",
      "Fetched page 837 with 24 movies.\n",
      "Fetched page 838 with 24 movies.\n",
      "Fetched page 839 with 24 movies.\n",
      "Fetched page 840 with 24 movies.\n",
      "Fetched page 841 with 24 movies.\n",
      "Fetched page 842 with 24 movies.\n",
      "Fetched page 843 with 24 movies.\n",
      "Fetched page 844 with 24 movies.\n",
      "Fetched page 845 with 24 movies.\n",
      "Fetched page 846 with 24 movies.\n",
      "Fetched page 847 with 24 movies.\n",
      "Fetched page 848 with 24 movies.\n",
      "Fetched page 849 with 24 movies.\n",
      "Fetched page 850 with 24 movies.\n",
      "Fetched page 851 with 24 movies.\n",
      "Fetched page 852 with 24 movies.\n",
      "Fetched page 853 with 24 movies.\n",
      "Fetched page 854 with 24 movies.\n",
      "Fetched page 855 with 24 movies.\n",
      "Fetched page 856 with 24 movies.\n",
      "Fetched page 857 with 24 movies.\n",
      "Fetched page 858 with 24 movies.\n",
      "Fetched page 859 with 24 movies.\n",
      "Fetched page 860 with 24 movies.\n",
      "Fetched page 861 with 24 movies.\n",
      "Fetched page 862 with 24 movies.\n",
      "Fetched page 863 with 24 movies.\n",
      "Fetched page 864 with 24 movies.\n",
      "Fetched page 865 with 24 movies.\n",
      "Fetched page 866 with 24 movies.\n",
      "Fetched page 867 with 24 movies.\n",
      "Fetched page 868 with 24 movies.\n",
      "Fetched page 869 with 24 movies.\n",
      "Fetched page 870 with 24 movies.\n",
      "Fetched page 871 with 24 movies.\n",
      "Fetched page 872 with 24 movies.\n",
      "Fetched page 873 with 24 movies.\n",
      "Fetched page 874 with 24 movies.\n",
      "Fetched page 875 with 24 movies.\n",
      "Fetched page 876 with 24 movies.\n",
      "Fetched page 877 with 24 movies.\n",
      "Fetched page 878 with 24 movies.\n",
      "Fetched page 879 with 24 movies.\n",
      "Fetched page 880 with 24 movies.\n",
      "Fetched page 881 with 24 movies.\n",
      "Fetched page 882 with 24 movies.\n",
      "Fetched page 883 with 24 movies.\n",
      "Fetched page 884 with 24 movies.\n",
      "Fetched page 885 with 24 movies.\n",
      "Fetched page 886 with 24 movies.\n",
      "Fetched page 887 with 24 movies.\n",
      "Fetched page 888 with 24 movies.\n",
      "Fetched page 889 with 24 movies.\n",
      "Fetched page 890 with 24 movies.\n",
      "Fetched page 891 with 24 movies.\n",
      "Fetched page 892 with 24 movies.\n",
      "Fetched page 893 with 24 movies.\n",
      "Fetched page 894 with 24 movies.\n",
      "Fetched page 895 with 24 movies.\n",
      "Fetched page 896 with 24 movies.\n",
      "Fetched page 897 with 24 movies.\n",
      "Fetched page 898 with 24 movies.\n",
      "Fetched page 899 with 24 movies.\n",
      "Fetched page 900 with 24 movies.\n",
      "Fetched page 901 with 24 movies.\n",
      "Fetched page 902 with 24 movies.\n",
      "Fetched page 903 with 24 movies.\n",
      "Fetched page 904 with 24 movies.\n",
      "Fetched page 905 with 24 movies.\n",
      "Fetched page 906 with 24 movies.\n",
      "Fetched page 907 with 24 movies.\n",
      "Fetched page 908 with 24 movies.\n",
      "Fetched page 909 with 24 movies.\n",
      "Fetched page 910 with 24 movies.\n",
      "Fetched page 911 with 24 movies.\n",
      "Fetched page 912 with 24 movies.\n",
      "Fetched page 913 with 24 movies.\n",
      "Fetched page 914 with 24 movies.\n",
      "Fetched page 915 with 24 movies.\n",
      "Fetched page 916 with 24 movies.\n",
      "Fetched page 917 with 24 movies.\n",
      "Fetched page 918 with 24 movies.\n",
      "Fetched page 919 with 24 movies.\n",
      "Fetched page 920 with 24 movies.\n",
      "Fetched page 921 with 24 movies.\n",
      "Fetched page 922 with 24 movies.\n",
      "Fetched page 923 with 24 movies.\n",
      "Fetched page 924 with 24 movies.\n",
      "Fetched page 925 with 24 movies.\n",
      "Fetched page 926 with 24 movies.\n",
      "Fetched page 927 with 24 movies.\n",
      "Fetched page 928 with 24 movies.\n",
      "Fetched page 929 with 24 movies.\n",
      "Fetched page 930 with 24 movies.\n",
      "Fetched page 931 with 24 movies.\n",
      "Fetched page 932 with 24 movies.\n",
      "Fetched page 933 with 24 movies.\n",
      "Fetched page 934 with 24 movies.\n",
      "Fetched page 935 with 24 movies.\n",
      "Fetched page 936 with 24 movies.\n",
      "Fetched page 937 with 24 movies.\n",
      "Fetched page 938 with 24 movies.\n",
      "Fetched page 939 with 24 movies.\n",
      "Fetched page 940 with 24 movies.\n",
      "Fetched page 941 with 24 movies.\n",
      "Fetched page 942 with 24 movies.\n",
      "Fetched page 943 with 24 movies.\n",
      "Fetched page 944 with 24 movies.\n",
      "Fetched page 945 with 24 movies.\n",
      "Fetched page 946 with 24 movies.\n",
      "Fetched page 947 with 24 movies.\n",
      "Fetched page 948 with 24 movies.\n",
      "Fetched page 949 with 24 movies.\n",
      "Fetched page 950 with 24 movies.\n",
      "Fetched page 951 with 24 movies.\n",
      "Fetched page 952 with 24 movies.\n",
      "Fetched page 953 with 24 movies.\n",
      "Fetched page 954 with 24 movies.\n",
      "Fetched page 955 with 24 movies.\n",
      "Fetched page 956 with 24 movies.\n",
      "Fetched page 957 with 24 movies.\n",
      "Fetched page 958 with 24 movies.\n",
      "Fetched page 959 with 24 movies.\n",
      "Fetched page 960 with 24 movies.\n",
      "Fetched page 961 with 24 movies.\n",
      "Fetched page 962 with 24 movies.\n",
      "Fetched page 963 with 24 movies.\n",
      "Fetched page 964 with 24 movies.\n",
      "Fetched page 965 with 24 movies.\n",
      "Fetched page 966 with 24 movies.\n",
      "Fetched page 967 with 24 movies.\n",
      "Fetched page 968 with 24 movies.\n",
      "Fetched page 969 with 24 movies.\n",
      "Fetched page 970 with 24 movies.\n",
      "Fetched page 971 with 24 movies.\n",
      "Fetched page 972 with 24 movies.\n",
      "Fetched page 973 with 24 movies.\n",
      "Fetched page 974 with 24 movies.\n",
      "Fetched page 975 with 24 movies.\n",
      "Fetched page 976 with 24 movies.\n",
      "Fetched page 977 with 24 movies.\n",
      "Fetched page 978 with 24 movies.\n",
      "Fetched page 979 with 24 movies.\n",
      "Fetched page 980 with 24 movies.\n",
      "Fetched page 981 with 24 movies.\n",
      "Fetched page 982 with 24 movies.\n",
      "Fetched page 983 with 24 movies.\n",
      "Fetched page 984 with 24 movies.\n",
      "Fetched page 985 with 24 movies.\n",
      "Fetched page 986 with 24 movies.\n",
      "Fetched page 987 with 24 movies.\n",
      "Fetched page 988 with 24 movies.\n",
      "Fetched page 989 with 24 movies.\n",
      "Fetched page 990 with 24 movies.\n",
      "Fetched page 991 with 24 movies.\n",
      "Fetched page 992 with 24 movies.\n",
      "Fetched page 993 with 24 movies.\n",
      "Fetched page 994 with 24 movies.\n",
      "Fetched page 995 with 24 movies.\n",
      "Fetched page 996 with 24 movies.\n",
      "Fetched page 997 with 24 movies.\n",
      "Fetched page 998 with 24 movies.\n",
      "Fetched page 999 with 24 movies.\n",
      "Fetched page 1000 with 24 movies.\n",
      "Fetched page 1001 with 24 movies.\n",
      "Fetched page 1002 with 24 movies.\n",
      "Fetched page 1003 with 24 movies.\n",
      "Fetched page 1004 with 24 movies.\n",
      "Fetched page 1005 with 24 movies.\n",
      "Fetched page 1006 with 24 movies.\n",
      "Fetched page 1007 with 24 movies.\n",
      "Fetched page 1008 with 24 movies.\n",
      "Fetched page 1009 with 24 movies.\n",
      "Fetched page 1010 with 24 movies.\n",
      "Fetched page 1011 with 24 movies.\n",
      "Fetched page 1012 with 24 movies.\n",
      "Fetched page 1013 with 24 movies.\n",
      "Fetched page 1014 with 24 movies.\n",
      "Fetched page 1015 with 24 movies.\n",
      "Fetched page 1016 with 24 movies.\n",
      "Fetched page 1017 with 24 movies.\n",
      "Fetched page 1018 with 24 movies.\n",
      "Fetched page 1019 with 24 movies.\n",
      "Fetched page 1020 with 24 movies.\n",
      "Fetched page 1021 with 24 movies.\n",
      "Fetched page 1022 with 24 movies.\n",
      "Fetched page 1023 with 24 movies.\n",
      "Fetched page 1024 with 24 movies.\n",
      "Fetched page 1025 with 24 movies.\n",
      "Fetched page 1026 with 24 movies.\n",
      "Fetched page 1027 with 24 movies.\n",
      "Fetched page 1028 with 24 movies.\n",
      "Fetched page 1029 with 24 movies.\n",
      "Fetched page 1030 with 24 movies.\n",
      "Fetched page 1031 with 24 movies.\n",
      "Fetched page 1032 with 24 movies.\n",
      "Fetched page 1033 with 24 movies.\n",
      "Fetched page 1034 with 24 movies.\n",
      "Fetched page 1035 with 24 movies.\n",
      "Fetched page 1036 with 24 movies.\n",
      "Fetched page 1037 with 24 movies.\n",
      "Fetched page 1038 with 24 movies.\n",
      "Fetched page 1039 with 24 movies.\n",
      "Fetched page 1040 with 24 movies.\n",
      "Fetched page 1041 with 24 movies.\n",
      "Fetched page 1042 with 24 movies.\n",
      "Fetched page 1043 with 24 movies.\n",
      "Fetched page 1044 with 24 movies.\n",
      "Fetched page 1045 with 24 movies.\n",
      "Fetched page 1046 with 24 movies.\n",
      "Fetched page 1047 with 24 movies.\n",
      "Fetched page 1048 with 24 movies.\n",
      "Fetched page 1049 with 24 movies.\n",
      "Fetched page 1050 with 24 movies.\n",
      "Fetched page 1051 with 24 movies.\n",
      "Fetched page 1052 with 24 movies.\n",
      "Fetched page 1053 with 24 movies.\n",
      "Fetched page 1054 with 24 movies.\n",
      "Fetched page 1055 with 24 movies.\n",
      "Fetched page 1056 with 24 movies.\n",
      "Fetched page 1057 with 24 movies.\n",
      "Fetched page 1058 with 24 movies.\n",
      "Fetched page 1059 with 24 movies.\n",
      "Fetched page 1060 with 24 movies.\n",
      "Fetched page 1061 with 24 movies.\n",
      "Fetched page 1062 with 24 movies.\n",
      "Fetched page 1063 with 24 movies.\n",
      "Fetched page 1064 with 24 movies.\n",
      "Fetched page 1065 with 24 movies.\n",
      "Fetched page 1066 with 24 movies.\n",
      "Fetched page 1067 with 24 movies.\n",
      "Fetched page 1068 with 24 movies.\n",
      "Fetched page 1069 with 24 movies.\n",
      "Fetched page 1070 with 24 movies.\n",
      "Fetched page 1071 with 24 movies.\n",
      "Fetched page 1072 with 24 movies.\n",
      "Fetched page 1073 with 24 movies.\n",
      "Fetched page 1074 with 24 movies.\n",
      "Fetched page 1075 with 24 movies.\n",
      "Fetched page 1076 with 24 movies.\n",
      "Fetched page 1077 with 24 movies.\n",
      "Fetched page 1078 with 24 movies.\n",
      "Fetched page 1079 with 24 movies.\n",
      "Fetched page 1080 with 24 movies.\n",
      "Fetched page 1081 with 24 movies.\n",
      "Fetched page 1082 with 24 movies.\n",
      "Fetched page 1083 with 24 movies.\n",
      "Fetched page 1084 with 24 movies.\n",
      "Fetched page 1085 with 24 movies.\n",
      "Fetched page 1086 with 24 movies.\n",
      "Fetched page 1087 with 24 movies.\n",
      "Fetched page 1088 with 24 movies.\n",
      "Fetched page 1089 with 24 movies.\n",
      "Fetched page 1090 with 24 movies.\n",
      "Fetched page 1091 with 24 movies.\n",
      "Fetched page 1092 with 24 movies.\n",
      "Fetched page 1093 with 24 movies.\n",
      "Fetched page 1094 with 24 movies.\n",
      "Fetched page 1095 with 24 movies.\n",
      "Fetched page 1096 with 24 movies.\n",
      "Fetched page 1097 with 24 movies.\n",
      "Fetched page 1098 with 24 movies.\n",
      "Fetched page 1099 with 24 movies.\n",
      "Fetched page 1100 with 24 movies.\n",
      "Fetched page 1101 with 24 movies.\n",
      "Fetched page 1102 with 24 movies.\n",
      "Fetched page 1103 with 24 movies.\n",
      "Fetched page 1104 with 24 movies.\n",
      "Fetched page 1105 with 24 movies.\n",
      "Fetched page 1106 with 24 movies.\n",
      "Fetched page 1107 with 24 movies.\n",
      "Fetched page 1108 with 24 movies.\n",
      "Fetched page 1109 with 24 movies.\n",
      "Fetched page 1110 with 24 movies.\n",
      "Fetched page 1111 with 24 movies.\n",
      "Fetched page 1112 with 24 movies.\n",
      "Fetched page 1113 with 24 movies.\n",
      "Fetched page 1114 with 24 movies.\n",
      "Fetched page 1115 with 24 movies.\n",
      "Fetched page 1116 with 24 movies.\n",
      "Fetched page 1117 with 24 movies.\n",
      "Fetched page 1118 with 24 movies.\n",
      "Fetched page 1119 with 24 movies.\n",
      "Fetched page 1120 with 24 movies.\n",
      "Fetched page 1121 with 24 movies.\n",
      "Fetched page 1122 with 24 movies.\n",
      "Fetched page 1123 with 24 movies.\n",
      "Fetched page 1124 with 24 movies.\n",
      "Fetched page 1125 with 24 movies.\n",
      "Fetched page 1126 with 24 movies.\n",
      "Fetched page 1127 with 24 movies.\n",
      "Fetched page 1128 with 24 movies.\n",
      "Fetched page 1129 with 24 movies.\n",
      "Fetched page 1130 with 24 movies.\n",
      "Fetched page 1131 with 24 movies.\n",
      "Fetched page 1132 with 24 movies.\n",
      "Fetched page 1133 with 24 movies.\n",
      "Fetched page 1134 with 24 movies.\n",
      "Fetched page 1135 with 24 movies.\n",
      "Fetched page 1136 with 24 movies.\n",
      "Fetched page 1137 with 24 movies.\n",
      "Fetched page 1138 with 24 movies.\n",
      "Fetched page 1139 with 24 movies.\n",
      "Fetched page 1140 with 24 movies.\n",
      "Fetched page 1141 with 24 movies.\n",
      "Fetched page 1142 with 24 movies.\n",
      "Fetched page 1143 with 24 movies.\n",
      "Fetched page 1144 with 24 movies.\n",
      "Fetched page 1145 with 24 movies.\n",
      "Fetched page 1146 with 24 movies.\n",
      "Fetched page 1147 with 24 movies.\n",
      "Fetched page 1148 with 24 movies.\n",
      "Fetched page 1149 with 24 movies.\n",
      "Fetched page 1150 with 24 movies.\n",
      "Fetched page 1151 with 24 movies.\n",
      "Fetched page 1152 with 24 movies.\n",
      "Fetched page 1153 with 24 movies.\n",
      "Fetched page 1154 with 24 movies.\n",
      "Fetched page 1155 with 24 movies.\n",
      "Fetched page 1156 with 24 movies.\n",
      "Fetched page 1157 with 24 movies.\n",
      "Fetched page 1158 with 24 movies.\n",
      "Fetched page 1159 with 24 movies.\n",
      "Fetched page 1160 with 24 movies.\n",
      "Fetched page 1161 with 24 movies.\n",
      "Fetched page 1162 with 24 movies.\n",
      "Fetched page 1163 with 24 movies.\n",
      "Fetched page 1164 with 24 movies.\n",
      "Fetched page 1165 with 24 movies.\n",
      "Fetched page 1166 with 24 movies.\n",
      "Fetched page 1167 with 24 movies.\n",
      "Fetched page 1168 with 24 movies.\n",
      "Fetched page 1169 with 24 movies.\n",
      "Fetched page 1170 with 24 movies.\n",
      "Fetched page 1171 with 24 movies.\n",
      "Fetched page 1172 with 24 movies.\n",
      "Fetched page 1173 with 24 movies.\n",
      "Fetched page 1174 with 24 movies.\n",
      "Fetched page 1175 with 24 movies.\n",
      "Fetched page 1176 with 24 movies.\n",
      "Fetched page 1177 with 24 movies.\n",
      "Fetched page 1178 with 24 movies.\n",
      "Fetched page 1179 with 24 movies.\n",
      "Fetched page 1180 with 24 movies.\n",
      "Fetched page 1181 with 24 movies.\n",
      "Fetched page 1182 with 24 movies.\n",
      "Fetched page 1183 with 24 movies.\n",
      "Fetched page 1184 with 24 movies.\n",
      "Fetched page 1185 with 24 movies.\n",
      "Fetched page 1186 with 24 movies.\n",
      "Fetched page 1187 with 24 movies.\n",
      "Fetched page 1188 with 24 movies.\n",
      "Fetched page 1189 with 24 movies.\n",
      "Fetched page 1190 with 24 movies.\n",
      "Fetched page 1191 with 24 movies.\n",
      "Fetched page 1192 with 24 movies.\n",
      "Fetched page 1193 with 24 movies.\n",
      "Fetched page 1194 with 24 movies.\n",
      "Fetched page 1195 with 24 movies.\n",
      "Fetched page 1196 with 24 movies.\n",
      "Fetched page 1197 with 24 movies.\n",
      "Fetched page 1198 with 24 movies.\n",
      "Fetched page 1199 with 24 movies.\n",
      "Fetched page 1200 with 24 movies.\n",
      "Fetched page 1201 with 24 movies.\n",
      "Fetched page 1202 with 24 movies.\n",
      "Fetched page 1203 with 24 movies.\n",
      "Fetched page 1204 with 24 movies.\n",
      "Fetched page 1205 with 24 movies.\n",
      "Fetched page 1206 with 24 movies.\n",
      "Fetched page 1207 with 24 movies.\n",
      "Fetched page 1208 with 24 movies.\n",
      "Fetched page 1209 with 24 movies.\n",
      "Fetched page 1210 with 24 movies.\n",
      "Fetched page 1211 with 24 movies.\n",
      "Fetched page 1212 with 24 movies.\n",
      "Fetched page 1213 with 24 movies.\n",
      "Fetched page 1214 with 24 movies.\n",
      "Fetched page 1215 with 24 movies.\n",
      "Fetched page 1216 with 24 movies.\n",
      "Fetched page 1217 with 24 movies.\n",
      "Fetched page 1218 with 24 movies.\n",
      "Fetched page 1219 with 24 movies.\n",
      "Fetched page 1220 with 24 movies.\n",
      "Fetched page 1221 with 24 movies.\n",
      "Fetched page 1222 with 24 movies.\n",
      "Fetched page 1223 with 24 movies.\n",
      "Fetched page 1224 with 24 movies.\n",
      "Fetched page 1225 with 24 movies.\n",
      "Fetched page 1226 with 24 movies.\n",
      "Fetched page 1227 with 24 movies.\n",
      "Fetched page 1228 with 24 movies.\n",
      "Fetched page 1229 with 24 movies.\n",
      "Fetched page 1230 with 24 movies.\n",
      "Fetched page 1231 with 24 movies.\n",
      "Fetched page 1232 with 24 movies.\n",
      "Fetched page 1233 with 24 movies.\n",
      "Fetched page 1234 with 24 movies.\n",
      "Fetched page 1235 with 24 movies.\n",
      "Fetched page 1236 with 24 movies.\n",
      "Fetched page 1237 with 24 movies.\n",
      "Fetched page 1238 with 24 movies.\n",
      "Fetched page 1239 with 24 movies.\n",
      "Fetched page 1240 with 24 movies.\n",
      "Fetched page 1241 with 24 movies.\n",
      "Fetched page 1242 with 24 movies.\n",
      "Fetched page 1243 with 24 movies.\n",
      "Fetched page 1244 with 24 movies.\n",
      "Fetched page 1245 with 24 movies.\n",
      "Fetched page 1246 with 24 movies.\n",
      "Fetched page 1247 with 24 movies.\n",
      "Fetched page 1248 with 24 movies.\n",
      "Fetched page 1249 with 24 movies.\n",
      "Fetched page 1250 with 24 movies.\n",
      "Fetched page 1251 with 24 movies.\n",
      "Fetched page 1252 with 24 movies.\n",
      "Fetched page 1253 with 24 movies.\n",
      "Fetched page 1254 with 24 movies.\n",
      "Fetched page 1255 with 24 movies.\n",
      "Fetched page 1256 with 24 movies.\n",
      "Fetched page 1257 with 24 movies.\n",
      "Fetched page 1258 with 24 movies.\n",
      "Fetched page 1259 with 24 movies.\n",
      "Fetched page 1260 with 24 movies.\n",
      "Fetched page 1261 with 24 movies.\n",
      "Fetched page 1262 with 24 movies.\n",
      "Fetched page 1263 with 24 movies.\n",
      "Fetched page 1264 with 24 movies.\n",
      "Fetched page 1265 with 24 movies.\n",
      "Fetched page 1266 with 24 movies.\n",
      "Fetched page 1267 with 24 movies.\n",
      "Fetched page 1268 with 24 movies.\n",
      "Fetched page 1269 with 24 movies.\n",
      "Fetched page 1270 with 24 movies.\n",
      "Fetched page 1271 with 24 movies.\n",
      "Fetched page 1272 with 24 movies.\n",
      "Fetched page 1273 with 24 movies.\n",
      "Fetched page 1274 with 24 movies.\n",
      "Fetched page 1275 with 24 movies.\n",
      "Fetched page 1276 with 24 movies.\n",
      "Fetched page 1277 with 24 movies.\n",
      "Fetched page 1278 with 24 movies.\n",
      "Fetched page 1279 with 24 movies.\n",
      "Fetched page 1280 with 24 movies.\n",
      "Fetched page 1281 with 24 movies.\n",
      "Fetched page 1282 with 24 movies.\n",
      "Fetched page 1283 with 24 movies.\n",
      "Fetched page 1284 with 24 movies.\n",
      "Fetched page 1285 with 24 movies.\n",
      "Fetched page 1286 with 24 movies.\n",
      "Fetched page 1287 with 24 movies.\n",
      "Fetched page 1288 with 24 movies.\n",
      "Fetched page 1289 with 24 movies.\n",
      "Fetched page 1290 with 24 movies.\n",
      "Fetched page 1291 with 24 movies.\n",
      "Fetched page 1292 with 24 movies.\n",
      "Fetched page 1293 with 24 movies.\n",
      "Fetched page 1294 with 24 movies.\n",
      "Fetched page 1295 with 24 movies.\n",
      "Fetched page 1296 with 24 movies.\n",
      "Fetched page 1297 with 24 movies.\n",
      "Fetched page 1298 with 24 movies.\n",
      "Fetched page 1299 with 24 movies.\n",
      "Fetched page 1300 with 24 movies.\n",
      "Fetched page 1301 with 24 movies.\n",
      "Fetched page 1302 with 24 movies.\n",
      "Fetched page 1303 with 24 movies.\n",
      "Fetched page 1304 with 24 movies.\n",
      "Fetched page 1305 with 24 movies.\n",
      "Fetched page 1306 with 24 movies.\n",
      "Fetched page 1307 with 24 movies.\n",
      "Fetched page 1308 with 24 movies.\n",
      "Fetched page 1309 with 24 movies.\n",
      "Fetched page 1310 with 24 movies.\n",
      "Fetched page 1311 with 24 movies.\n",
      "Fetched page 1312 with 24 movies.\n",
      "Fetched page 1313 with 24 movies.\n",
      "Fetched page 1314 with 24 movies.\n",
      "Fetched page 1315 with 24 movies.\n",
      "Fetched page 1316 with 24 movies.\n",
      "Fetched page 1317 with 24 movies.\n",
      "Fetched page 1318 with 24 movies.\n",
      "Fetched page 1319 with 24 movies.\n",
      "Fetched page 1320 with 24 movies.\n",
      "Fetched page 1321 with 24 movies.\n",
      "Fetched page 1322 with 24 movies.\n",
      "Fetched page 1323 with 24 movies.\n",
      "Fetched page 1324 with 24 movies.\n",
      "Fetched page 1325 with 24 movies.\n",
      "Fetched page 1326 with 24 movies.\n",
      "Fetched page 1327 with 24 movies.\n",
      "Fetched page 1328 with 24 movies.\n",
      "Fetched page 1329 with 24 movies.\n",
      "Fetched page 1330 with 24 movies.\n",
      "Fetched page 1331 with 24 movies.\n",
      "Fetched page 1332 with 24 movies.\n",
      "Fetched page 1333 with 24 movies.\n",
      "Fetched page 1334 with 24 movies.\n",
      "Fetched page 1335 with 24 movies.\n",
      "Fetched page 1336 with 24 movies.\n",
      "Fetched page 1337 with 24 movies.\n",
      "Fetched page 1338 with 24 movies.\n",
      "Fetched page 1339 with 24 movies.\n",
      "Fetched page 1340 with 24 movies.\n",
      "Fetched page 1341 with 24 movies.\n",
      "Fetched page 1342 with 24 movies.\n",
      "Fetched page 1343 with 24 movies.\n",
      "Fetched page 1344 with 24 movies.\n",
      "Fetched page 1345 with 24 movies.\n",
      "Fetched page 1346 with 24 movies.\n",
      "Fetched page 1347 with 24 movies.\n",
      "Fetched page 1348 with 24 movies.\n",
      "Fetched page 1349 with 24 movies.\n",
      "Fetched page 1350 with 24 movies.\n",
      "Fetched page 1351 with 24 movies.\n",
      "Fetched page 1352 with 24 movies.\n",
      "Fetched page 1353 with 24 movies.\n",
      "Fetched page 1354 with 24 movies.\n",
      "Fetched page 1355 with 24 movies.\n",
      "Fetched page 1356 with 24 movies.\n",
      "Fetched page 1357 with 24 movies.\n",
      "Fetched page 1358 with 24 movies.\n",
      "Fetched page 1359 with 24 movies.\n",
      "Fetched page 1360 with 24 movies.\n",
      "Fetched page 1361 with 24 movies.\n",
      "Fetched page 1362 with 24 movies.\n",
      "Fetched page 1363 with 24 movies.\n",
      "Fetched page 1364 with 24 movies.\n",
      "Fetched page 1365 with 24 movies.\n",
      "Fetched page 1366 with 24 movies.\n",
      "Fetched page 1367 with 24 movies.\n",
      "Fetched page 1368 with 24 movies.\n",
      "Fetched page 1369 with 24 movies.\n",
      "Fetched page 1370 with 24 movies.\n",
      "Fetched page 1371 with 24 movies.\n",
      "Fetched page 1372 with 24 movies.\n",
      "Fetched page 1373 with 24 movies.\n",
      "Fetched page 1374 with 24 movies.\n",
      "Fetched page 1375 with 24 movies.\n",
      "Fetched page 1376 with 24 movies.\n",
      "Fetched page 1377 with 24 movies.\n",
      "Fetched page 1378 with 24 movies.\n",
      "Fetched page 1379 with 24 movies.\n",
      "Fetched page 1380 with 24 movies.\n",
      "Fetched page 1381 with 24 movies.\n",
      "Fetched page 1382 with 24 movies.\n",
      "Fetched page 1383 with 24 movies.\n",
      "Fetched page 1384 with 24 movies.\n",
      "Fetched page 1385 with 24 movies.\n",
      "Fetched page 1386 with 24 movies.\n",
      "Fetched page 1387 with 24 movies.\n",
      "Fetched page 1388 with 24 movies.\n",
      "Fetched page 1389 with 24 movies.\n",
      "Fetched page 1390 with 24 movies.\n",
      "Fetched page 1391 with 24 movies.\n",
      "Fetched page 1392 with 24 movies.\n",
      "Fetched page 1393 with 24 movies.\n",
      "Fetched page 1394 with 24 movies.\n",
      "Fetched page 1395 with 24 movies.\n",
      "Fetched page 1396 with 24 movies.\n",
      "Fetched page 1397 with 24 movies.\n",
      "Fetched page 1398 with 24 movies.\n",
      "Fetched page 1399 with 24 movies.\n",
      "Fetched page 1400 with 24 movies.\n",
      "Fetched page 1401 with 24 movies.\n",
      "Fetched page 1402 with 24 movies.\n",
      "Fetched page 1403 with 24 movies.\n",
      "Fetched page 1404 with 24 movies.\n",
      "Fetched page 1405 with 24 movies.\n",
      "Fetched page 1406 with 24 movies.\n",
      "Fetched page 1407 with 24 movies.\n",
      "Fetched page 1408 with 24 movies.\n",
      "Fetched page 1409 with 24 movies.\n",
      "Fetched page 1410 with 24 movies.\n",
      "Fetched page 1411 with 24 movies.\n",
      "Fetched page 1412 with 24 movies.\n",
      "Fetched page 1413 with 24 movies.\n",
      "Fetched page 1414 with 24 movies.\n",
      "Fetched page 1415 with 24 movies.\n",
      "Fetched page 1416 with 24 movies.\n",
      "Fetched page 1417 with 24 movies.\n",
      "Fetched page 1418 with 24 movies.\n",
      "Fetched page 1419 with 24 movies.\n",
      "Fetched page 1420 with 24 movies.\n",
      "Fetched page 1421 with 24 movies.\n",
      "Fetched page 1422 with 24 movies.\n",
      "Fetched page 1423 with 24 movies.\n",
      "Fetched page 1424 with 24 movies.\n",
      "Fetched page 1425 with 24 movies.\n",
      "Fetched page 1426 with 24 movies.\n",
      "Fetched page 1427 with 24 movies.\n",
      "Fetched page 1428 with 24 movies.\n",
      "Fetched page 1429 with 24 movies.\n",
      "Fetched page 1430 with 24 movies.\n",
      "Fetched page 1431 with 24 movies.\n",
      "Fetched page 1432 with 24 movies.\n",
      "Fetched page 1433 with 24 movies.\n",
      "Fetched page 1434 with 24 movies.\n",
      "Fetched page 1435 with 24 movies.\n",
      "Fetched page 1436 with 24 movies.\n",
      "Fetched page 1437 with 24 movies.\n",
      "Fetched page 1438 with 24 movies.\n",
      "Fetched page 1439 with 24 movies.\n",
      "Fetched page 1440 with 24 movies.\n",
      "Fetched page 1441 with 24 movies.\n",
      "Fetched page 1442 with 24 movies.\n",
      "Fetched page 1443 with 24 movies.\n",
      "Fetched page 1444 with 24 movies.\n",
      "Fetched page 1445 with 24 movies.\n",
      "Fetched page 1446 with 24 movies.\n",
      "Fetched page 1447 with 24 movies.\n",
      "Fetched page 1448 with 24 movies.\n",
      "Fetched page 1449 with 24 movies.\n",
      "Fetched page 1450 with 24 movies.\n",
      "Fetched page 1451 with 24 movies.\n",
      "Fetched page 1452 with 24 movies.\n",
      "Fetched page 1453 with 24 movies.\n",
      "Fetched page 1454 with 24 movies.\n",
      "Fetched page 1455 with 24 movies.\n",
      "Fetched page 1456 with 24 movies.\n",
      "Fetched page 1457 with 24 movies.\n",
      "Fetched page 1458 with 24 movies.\n",
      "Fetched page 1459 with 24 movies.\n",
      "Fetched page 1460 with 24 movies.\n",
      "Fetched page 1461 with 24 movies.\n",
      "Fetched page 1462 with 24 movies.\n",
      "Fetched page 1463 with 24 movies.\n",
      "Fetched page 1464 with 24 movies.\n",
      "Fetched page 1465 with 24 movies.\n",
      "Fetched page 1466 with 24 movies.\n",
      "Fetched page 1467 with 24 movies.\n",
      "Fetched page 1468 with 24 movies.\n",
      "Fetched page 1469 with 24 movies.\n",
      "Fetched page 1470 with 24 movies.\n",
      "Fetched page 1471 with 24 movies.\n",
      "Fetched page 1472 with 24 movies.\n",
      "Fetched page 1473 with 24 movies.\n",
      "Fetched page 1474 with 24 movies.\n",
      "Fetched page 1475 with 24 movies.\n",
      "Fetched page 1476 with 24 movies.\n",
      "Fetched page 1477 with 24 movies.\n",
      "Fetched page 1478 with 24 movies.\n",
      "Fetched page 1479 with 24 movies.\n",
      "Fetched page 1480 with 24 movies.\n",
      "Fetched page 1481 with 24 movies.\n",
      "Fetched page 1482 with 24 movies.\n",
      "Fetched page 1483 with 24 movies.\n",
      "Fetched page 1484 with 24 movies.\n",
      "Fetched page 1485 with 24 movies.\n",
      "Fetched page 1486 with 24 movies.\n",
      "Fetched page 1487 with 24 movies.\n",
      "Fetched page 1488 with 24 movies.\n",
      "Fetched page 1489 with 24 movies.\n",
      "Fetched page 1490 with 24 movies.\n",
      "Fetched page 1491 with 24 movies.\n",
      "Fetched page 1492 with 24 movies.\n",
      "Fetched page 1493 with 24 movies.\n",
      "Fetched page 1494 with 24 movies.\n",
      "Fetched page 1495 with 24 movies.\n",
      "Fetched page 1496 with 24 movies.\n",
      "Fetched page 1497 with 24 movies.\n",
      "Fetched page 1498 with 24 movies.\n",
      "Fetched page 1499 with 24 movies.\n",
      "Fetched page 1500 with 24 movies.\n",
      "Fetched page 1501 with 24 movies.\n",
      "Fetched page 1502 with 24 movies.\n",
      "Fetched page 1503 with 24 movies.\n",
      "Fetched page 1504 with 24 movies.\n",
      "Fetched page 1505 with 24 movies.\n",
      "Fetched page 1506 with 24 movies.\n",
      "Fetched page 1507 with 24 movies.\n",
      "Fetched page 1508 with 24 movies.\n",
      "Fetched page 1509 with 24 movies.\n",
      "Fetched page 1510 with 24 movies.\n",
      "Fetched page 1511 with 24 movies.\n",
      "Fetched page 1512 with 24 movies.\n",
      "Fetched page 1513 with 24 movies.\n",
      "Fetched page 1514 with 24 movies.\n",
      "Fetched page 1515 with 24 movies.\n",
      "Fetched page 1516 with 24 movies.\n",
      "Fetched page 1517 with 24 movies.\n",
      "Fetched page 1518 with 24 movies.\n",
      "Fetched page 1519 with 24 movies.\n",
      "Fetched page 1520 with 24 movies.\n",
      "Fetched page 1521 with 24 movies.\n",
      "Fetched page 1522 with 24 movies.\n",
      "Fetched page 1523 with 24 movies.\n",
      "Fetched page 1524 with 24 movies.\n",
      "Fetched page 1525 with 24 movies.\n",
      "Fetched page 1526 with 24 movies.\n",
      "Fetched page 1527 with 24 movies.\n",
      "Fetched page 1528 with 24 movies.\n",
      "Fetched page 1529 with 24 movies.\n",
      "Fetched page 1530 with 24 movies.\n",
      "Fetched page 1531 with 24 movies.\n",
      "Fetched page 1532 with 24 movies.\n",
      "Fetched page 1533 with 24 movies.\n",
      "Fetched page 1534 with 24 movies.\n",
      "Fetched page 1535 with 24 movies.\n",
      "Fetched page 1536 with 24 movies.\n",
      "Fetched page 1537 with 24 movies.\n",
      "Fetched page 1538 with 24 movies.\n",
      "Fetched page 1539 with 24 movies.\n",
      "Fetched page 1540 with 24 movies.\n",
      "Fetched page 1541 with 24 movies.\n",
      "Fetched page 1542 with 24 movies.\n",
      "Fetched page 1543 with 24 movies.\n",
      "Fetched page 1544 with 24 movies.\n",
      "Fetched page 1545 with 24 movies.\n",
      "Fetched page 1546 with 24 movies.\n",
      "Fetched page 1547 with 24 movies.\n",
      "Fetched page 1548 with 24 movies.\n",
      "Fetched page 1549 with 24 movies.\n",
      "Fetched page 1550 with 24 movies.\n",
      "Fetched page 1551 with 24 movies.\n",
      "Fetched page 1552 with 24 movies.\n",
      "Fetched page 1553 with 24 movies.\n",
      "Fetched page 1554 with 24 movies.\n",
      "Fetched page 1555 with 24 movies.\n",
      "Fetched page 1556 with 24 movies.\n",
      "Fetched page 1557 with 24 movies.\n",
      "Fetched page 1558 with 24 movies.\n",
      "Fetched page 1559 with 24 movies.\n",
      "Fetched page 1560 with 24 movies.\n",
      "Fetched page 1561 with 24 movies.\n",
      "Fetched page 1562 with 24 movies.\n",
      "Fetched page 1563 with 24 movies.\n",
      "Fetched page 1564 with 24 movies.\n",
      "Fetched page 1565 with 24 movies.\n",
      "Fetched page 1566 with 24 movies.\n",
      "Fetched page 1567 with 24 movies.\n",
      "Fetched page 1568 with 24 movies.\n",
      "Fetched page 1569 with 24 movies.\n",
      "Fetched page 1570 with 24 movies.\n",
      "Fetched page 1571 with 24 movies.\n",
      "Fetched page 1572 with 24 movies.\n",
      "Fetched page 1573 with 24 movies.\n",
      "Fetched page 1574 with 24 movies.\n",
      "Fetched page 1575 with 24 movies.\n",
      "Fetched page 1576 with 24 movies.\n",
      "Fetched page 1577 with 24 movies.\n",
      "Fetched page 1578 with 24 movies.\n",
      "Fetched page 1579 with 24 movies.\n",
      "Fetched page 1580 with 24 movies.\n",
      "Fetched page 1581 with 24 movies.\n",
      "Fetched page 1582 with 24 movies.\n",
      "Fetched page 1583 with 24 movies.\n",
      "Fetched page 1584 with 24 movies.\n",
      "Fetched page 1585 with 24 movies.\n",
      "Fetched page 1586 with 24 movies.\n",
      "Fetched page 1587 with 24 movies.\n",
      "Fetched page 1588 with 24 movies.\n",
      "Fetched page 1589 with 24 movies.\n",
      "Fetched page 1590 with 24 movies.\n",
      "Fetched page 1591 with 24 movies.\n",
      "Fetched page 1592 with 24 movies.\n",
      "Fetched page 1593 with 24 movies.\n",
      "Fetched page 1594 with 24 movies.\n",
      "Fetched page 1595 with 24 movies.\n",
      "Fetched page 1596 with 24 movies.\n",
      "Fetched page 1597 with 24 movies.\n",
      "Fetched page 1598 with 24 movies.\n",
      "Fetched page 1599 with 24 movies.\n",
      "Fetched page 1600 with 24 movies.\n",
      "Fetched page 1601 with 24 movies.\n",
      "Fetched page 1602 with 24 movies.\n",
      "Fetched page 1603 with 24 movies.\n",
      "Fetched page 1604 with 24 movies.\n",
      "Fetched page 1605 with 24 movies.\n",
      "Fetched page 1606 with 24 movies.\n",
      "Fetched page 1607 with 24 movies.\n",
      "Fetched page 1608 with 24 movies.\n",
      "Fetched page 1609 with 24 movies.\n",
      "Fetched page 1610 with 24 movies.\n",
      "Fetched page 1611 with 24 movies.\n",
      "Fetched page 1612 with 24 movies.\n",
      "Fetched page 1613 with 24 movies.\n",
      "Fetched page 1614 with 24 movies.\n",
      "Fetched page 1615 with 24 movies.\n",
      "Fetched page 1616 with 24 movies.\n",
      "Fetched page 1617 with 24 movies.\n",
      "Fetched page 1618 with 24 movies.\n",
      "Fetched page 1619 with 24 movies.\n",
      "Fetched page 1620 with 24 movies.\n",
      "Fetched page 1621 with 24 movies.\n",
      "Fetched page 1622 with 24 movies.\n",
      "Fetched page 1623 with 24 movies.\n",
      "Fetched page 1624 with 24 movies.\n",
      "Fetched page 1625 with 24 movies.\n",
      "Fetched page 1626 with 24 movies.\n",
      "Fetched page 1627 with 24 movies.\n",
      "Fetched page 1628 with 24 movies.\n",
      "Fetched page 1629 with 24 movies.\n",
      "Fetched page 1630 with 24 movies.\n",
      "Fetched page 1631 with 24 movies.\n",
      "Fetched page 1632 with 24 movies.\n",
      "Fetched page 1633 with 24 movies.\n",
      "Fetched page 1634 with 24 movies.\n",
      "Fetched page 1635 with 24 movies.\n",
      "Fetched page 1636 with 24 movies.\n",
      "Fetched page 1637 with 24 movies.\n",
      "Fetched page 1638 with 24 movies.\n",
      "Fetched page 1639 with 24 movies.\n",
      "Fetched page 1640 with 24 movies.\n",
      "Fetched page 1641 with 24 movies.\n",
      "Fetched page 1642 with 24 movies.\n",
      "Fetched page 1643 with 24 movies.\n",
      "Fetched page 1644 with 24 movies.\n",
      "Fetched page 1645 with 24 movies.\n",
      "Fetched page 1646 with 24 movies.\n",
      "Fetched page 1647 with 24 movies.\n",
      "Fetched page 1648 with 24 movies.\n",
      "Fetched page 1649 with 24 movies.\n",
      "Fetched page 1650 with 24 movies.\n",
      "Fetched page 1651 with 24 movies.\n",
      "Fetched page 1652 with 24 movies.\n",
      "Fetched page 1653 with 24 movies.\n",
      "Fetched page 1654 with 24 movies.\n",
      "Fetched page 1655 with 24 movies.\n",
      "Fetched page 1656 with 24 movies.\n",
      "Fetched page 1657 with 24 movies.\n",
      "Fetched page 1658 with 24 movies.\n",
      "Fetched page 1659 with 24 movies.\n",
      "Fetched page 1660 with 24 movies.\n",
      "Fetched page 1661 with 24 movies.\n",
      "Fetched page 1662 with 24 movies.\n",
      "Fetched page 1663 with 24 movies.\n",
      "Fetched page 1664 with 24 movies.\n",
      "Fetched page 1665 with 24 movies.\n",
      "Fetched page 1666 with 24 movies.\n",
      "Fetched page 1667 with 24 movies.\n",
      "Fetched page 1668 with 24 movies.\n",
      "Fetched page 1669 with 24 movies.\n",
      "Fetched page 1670 with 24 movies.\n",
      "Fetched page 1671 with 24 movies.\n",
      "Fetched page 1672 with 24 movies.\n",
      "Fetched page 1673 with 24 movies.\n",
      "Fetched page 1674 with 24 movies.\n",
      "Fetched page 1675 with 24 movies.\n",
      "Fetched page 1676 with 24 movies.\n",
      "Fetched page 1677 with 24 movies.\n",
      "Fetched page 1678 with 24 movies.\n",
      "Fetched page 1679 with 24 movies.\n",
      "Fetched page 1680 with 24 movies.\n",
      "Fetched page 1681 with 24 movies.\n",
      "Fetched page 1682 with 24 movies.\n",
      "Fetched page 1683 with 24 movies.\n",
      "Fetched page 1684 with 24 movies.\n",
      "Fetched page 1685 with 24 movies.\n",
      "Fetched page 1686 with 24 movies.\n",
      "Fetched page 1687 with 24 movies.\n",
      "Fetched page 1688 with 24 movies.\n",
      "Fetched page 1689 with 24 movies.\n",
      "Fetched page 1690 with 24 movies.\n",
      "Fetched page 1691 with 24 movies.\n",
      "Fetched page 1692 with 24 movies.\n",
      "Fetched page 1693 with 24 movies.\n",
      "Fetched page 1694 with 24 movies.\n",
      "Fetched page 1695 with 24 movies.\n",
      "Fetched page 1696 with 24 movies.\n",
      "Fetched page 1697 with 24 movies.\n",
      "Fetched page 1698 with 24 movies.\n",
      "Fetched page 1699 with 24 movies.\n",
      "Fetched page 1700 with 24 movies.\n",
      "Fetched page 1701 with 24 movies.\n",
      "Fetched page 1702 with 24 movies.\n",
      "Fetched page 1703 with 24 movies.\n",
      "Fetched page 1704 with 24 movies.\n",
      "Fetched page 1705 with 24 movies.\n",
      "Fetched page 1706 with 24 movies.\n",
      "Fetched page 1707 with 24 movies.\n",
      "Fetched page 1708 with 24 movies.\n",
      "Fetched page 1709 with 24 movies.\n",
      "Fetched page 1710 with 24 movies.\n",
      "Fetched page 1711 with 24 movies.\n",
      "Fetched page 1712 with 24 movies.\n",
      "Fetched page 1713 with 24 movies.\n",
      "Fetched page 1714 with 24 movies.\n",
      "Fetched page 1715 with 24 movies.\n",
      "Fetched page 1716 with 24 movies.\n",
      "Fetched page 1717 with 24 movies.\n",
      "Fetched page 1718 with 24 movies.\n",
      "Fetched page 1719 with 24 movies.\n",
      "Fetched page 1720 with 24 movies.\n",
      "Fetched page 1721 with 24 movies.\n",
      "Fetched page 1722 with 24 movies.\n",
      "Fetched page 1723 with 24 movies.\n",
      "Fetched page 1724 with 24 movies.\n",
      "Fetched page 1725 with 24 movies.\n",
      "Fetched page 1726 with 24 movies.\n",
      "Fetched page 1727 with 24 movies.\n",
      "Fetched page 1728 with 24 movies.\n",
      "Fetched page 1729 with 24 movies.\n",
      "Fetched page 1730 with 24 movies.\n",
      "Fetched page 1731 with 24 movies.\n",
      "Fetched page 1732 with 24 movies.\n",
      "Fetched page 1733 with 24 movies.\n",
      "Fetched page 1734 with 24 movies.\n",
      "Fetched page 1735 with 24 movies.\n",
      "Fetched page 1736 with 24 movies.\n",
      "Fetched page 1737 with 24 movies.\n",
      "Fetched page 1738 with 24 movies.\n",
      "Fetched page 1739 with 24 movies.\n",
      "Fetched page 1740 with 24 movies.\n",
      "Fetched page 1741 with 24 movies.\n",
      "Fetched page 1742 with 24 movies.\n",
      "Fetched page 1743 with 24 movies.\n",
      "Fetched page 1744 with 24 movies.\n",
      "Fetched page 1745 with 24 movies.\n",
      "Fetched page 1746 with 24 movies.\n",
      "Fetched page 1747 with 24 movies.\n",
      "Fetched page 1748 with 24 movies.\n",
      "Fetched page 1749 with 24 movies.\n",
      "Fetched page 1750 with 24 movies.\n",
      "Fetched page 1751 with 24 movies.\n",
      "Fetched page 1752 with 24 movies.\n",
      "Fetched page 1753 with 24 movies.\n",
      "Fetched page 1754 with 24 movies.\n",
      "Fetched page 1755 with 24 movies.\n",
      "Fetched page 1756 with 24 movies.\n",
      "Fetched page 1757 with 24 movies.\n",
      "Fetched page 1758 with 24 movies.\n",
      "Fetched page 1759 with 24 movies.\n",
      "Fetched page 1760 with 24 movies.\n",
      "Fetched page 1761 with 24 movies.\n",
      "Fetched page 1762 with 24 movies.\n",
      "Fetched page 1763 with 24 movies.\n",
      "Fetched page 1764 with 24 movies.\n",
      "Fetched page 1765 with 24 movies.\n",
      "Fetched page 1766 with 24 movies.\n",
      "Fetched page 1767 with 24 movies.\n",
      "Fetched page 1768 with 24 movies.\n",
      "Fetched page 1769 with 24 movies.\n",
      "Fetched page 1770 with 24 movies.\n",
      "Fetched page 1771 with 24 movies.\n",
      "Fetched page 1772 with 24 movies.\n",
      "Fetched page 1773 with 24 movies.\n",
      "Fetched page 1774 with 24 movies.\n",
      "Fetched page 1775 with 24 movies.\n",
      "Fetched page 1776 with 24 movies.\n",
      "Fetched page 1777 with 24 movies.\n",
      "Fetched page 1778 with 24 movies.\n",
      "Fetched page 1779 with 24 movies.\n",
      "Fetched page 1780 with 24 movies.\n",
      "Fetched page 1781 with 24 movies.\n",
      "Fetched page 1782 with 24 movies.\n",
      "Fetched page 1783 with 24 movies.\n",
      "Fetched page 1784 with 24 movies.\n",
      "Fetched page 1785 with 24 movies.\n",
      "Fetched page 1786 with 24 movies.\n",
      "Fetched page 1787 with 24 movies.\n",
      "Fetched page 1788 with 24 movies.\n",
      "Fetched page 1789 with 24 movies.\n",
      "Fetched page 1790 with 24 movies.\n",
      "Fetched page 1791 with 24 movies.\n",
      "Fetched page 1792 with 24 movies.\n",
      "Fetched page 1793 with 24 movies.\n",
      "Fetched page 1794 with 24 movies.\n",
      "Fetched page 1795 with 24 movies.\n",
      "Fetched page 1796 with 24 movies.\n",
      "Fetched page 1797 with 24 movies.\n",
      "Fetched page 1798 with 24 movies.\n",
      "Fetched page 1799 with 24 movies.\n",
      "Fetched page 1800 with 24 movies.\n",
      "Fetched page 1801 with 24 movies.\n",
      "Fetched page 1802 with 24 movies.\n",
      "Fetched page 1803 with 24 movies.\n",
      "Fetched page 1804 with 24 movies.\n",
      "Fetched page 1805 with 24 movies.\n",
      "Fetched page 1806 with 24 movies.\n",
      "Fetched page 1807 with 24 movies.\n",
      "Fetched page 1808 with 24 movies.\n",
      "Fetched page 1809 with 24 movies.\n",
      "Fetched page 1810 with 24 movies.\n",
      "Fetched page 1811 with 24 movies.\n",
      "Fetched page 1812 with 24 movies.\n",
      "Fetched page 1813 with 24 movies.\n",
      "Fetched page 1814 with 24 movies.\n",
      "Fetched page 1815 with 24 movies.\n",
      "Fetched page 1816 with 24 movies.\n",
      "Fetched page 1817 with 24 movies.\n",
      "Fetched page 1818 with 24 movies.\n",
      "Fetched page 1819 with 24 movies.\n",
      "Fetched page 1820 with 24 movies.\n",
      "Fetched page 1821 with 24 movies.\n",
      "Fetched page 1822 with 24 movies.\n",
      "Fetched page 1823 with 24 movies.\n",
      "Fetched page 1824 with 24 movies.\n",
      "Fetched page 1825 with 24 movies.\n",
      "Fetched page 1826 with 24 movies.\n",
      "Fetched page 1827 with 24 movies.\n",
      "Fetched page 1828 with 24 movies.\n",
      "Fetched page 1829 with 24 movies.\n",
      "Fetched page 1830 with 24 movies.\n",
      "Fetched page 1831 with 24 movies.\n",
      "Fetched page 1832 with 24 movies.\n",
      "Fetched page 1833 with 24 movies.\n",
      "Fetched page 1834 with 24 movies.\n",
      "Fetched page 1835 with 24 movies.\n",
      "Fetched page 1836 with 24 movies.\n",
      "Fetched page 1837 with 24 movies.\n",
      "Fetched page 1838 with 24 movies.\n",
      "Fetched page 1839 with 24 movies.\n",
      "Fetched page 1840 with 24 movies.\n",
      "Fetched page 1841 with 24 movies.\n",
      "Fetched page 1842 with 24 movies.\n",
      "Fetched page 1843 with 24 movies.\n",
      "Fetched page 1844 with 24 movies.\n",
      "Fetched page 1845 with 24 movies.\n",
      "Fetched page 1846 with 24 movies.\n",
      "Fetched page 1847 with 24 movies.\n",
      "Fetched page 1848 with 24 movies.\n",
      "Fetched page 1849 with 24 movies.\n",
      "Fetched page 1850 with 24 movies.\n",
      "Fetched page 1851 with 24 movies.\n",
      "Fetched page 1852 with 24 movies.\n",
      "Fetched page 1853 with 24 movies.\n",
      "Fetched page 1854 with 24 movies.\n",
      "Fetched page 1855 with 24 movies.\n",
      "Fetched page 1856 with 24 movies.\n",
      "Fetched page 1857 with 24 movies.\n",
      "Fetched page 1858 with 24 movies.\n",
      "Fetched page 1859 with 24 movies.\n",
      "Fetched page 1860 with 24 movies.\n",
      "Fetched page 1861 with 24 movies.\n",
      "Fetched page 1862 with 24 movies.\n",
      "Fetched page 1863 with 24 movies.\n",
      "Fetched page 1864 with 24 movies.\n",
      "Fetched page 1865 with 24 movies.\n",
      "Fetched page 1866 with 24 movies.\n",
      "Fetched page 1867 with 24 movies.\n",
      "Fetched page 1868 with 24 movies.\n",
      "Fetched page 1869 with 24 movies.\n",
      "Fetched page 1870 with 24 movies.\n",
      "Fetched page 1871 with 24 movies.\n",
      "Fetched page 1872 with 24 movies.\n",
      "Fetched page 1873 with 24 movies.\n",
      "Fetched page 1874 with 24 movies.\n",
      "Fetched page 1875 with 24 movies.\n",
      "Fetched page 1876 with 24 movies.\n",
      "Fetched page 1877 with 24 movies.\n",
      "Fetched page 1878 with 24 movies.\n",
      "Fetched page 1879 with 24 movies.\n",
      "Fetched page 1880 with 24 movies.\n",
      "Fetched page 1881 with 24 movies.\n",
      "Fetched page 1882 with 24 movies.\n",
      "Fetched page 1883 with 24 movies.\n",
      "Fetched page 1884 with 24 movies.\n",
      "Fetched page 1885 with 24 movies.\n",
      "Fetched page 1886 with 24 movies.\n",
      "Fetched page 1887 with 24 movies.\n",
      "Fetched page 1888 with 24 movies.\n",
      "Fetched page 1889 with 24 movies.\n",
      "Fetched page 1890 with 24 movies.\n",
      "Fetched page 1891 with 24 movies.\n",
      "Fetched page 1892 with 24 movies.\n",
      "Fetched page 1893 with 24 movies.\n",
      "Fetched page 1894 with 24 movies.\n",
      "Fetched page 1895 with 24 movies.\n",
      "Fetched page 1896 with 24 movies.\n",
      "Fetched page 1897 with 24 movies.\n",
      "Fetched page 1898 with 24 movies.\n",
      "Fetched page 1899 with 24 movies.\n",
      "Fetched page 1900 with 24 movies.\n",
      "Fetched page 1901 with 24 movies.\n",
      "Fetched page 1902 with 24 movies.\n",
      "Fetched page 1903 with 24 movies.\n",
      "Fetched page 1904 with 24 movies.\n",
      "Fetched page 1905 with 24 movies.\n",
      "Fetched page 1906 with 24 movies.\n",
      "Fetched page 1907 with 24 movies.\n",
      "Fetched page 1908 with 24 movies.\n",
      "Fetched page 1909 with 24 movies.\n",
      "Fetched page 1910 with 24 movies.\n",
      "Fetched page 1911 with 24 movies.\n",
      "Fetched page 1912 with 24 movies.\n",
      "Fetched page 1913 with 24 movies.\n",
      "Fetched page 1914 with 24 movies.\n",
      "Fetched page 1915 with 24 movies.\n",
      "Fetched page 1916 with 24 movies.\n",
      "Fetched page 1917 with 24 movies.\n",
      "Fetched page 1918 with 24 movies.\n",
      "Fetched page 1919 with 24 movies.\n",
      "Fetched page 1920 with 24 movies.\n",
      "Fetched page 1921 with 24 movies.\n",
      "Fetched page 1922 with 24 movies.\n",
      "Fetched page 1923 with 24 movies.\n",
      "Fetched page 1924 with 24 movies.\n",
      "Fetched page 1925 with 24 movies.\n",
      "Fetched page 1926 with 24 movies.\n",
      "Fetched page 1927 with 24 movies.\n",
      "Fetched page 1928 with 24 movies.\n",
      "Fetched page 1929 with 24 movies.\n",
      "Fetched page 1930 with 24 movies.\n",
      "Fetched page 1931 with 24 movies.\n",
      "Fetched page 1932 with 24 movies.\n",
      "Fetched page 1933 with 24 movies.\n",
      "Fetched page 1934 with 24 movies.\n",
      "Fetched page 1935 with 24 movies.\n",
      "Fetched page 1936 with 24 movies.\n",
      "Fetched page 1937 with 24 movies.\n",
      "Fetched page 1938 with 24 movies.\n",
      "Fetched page 1939 with 24 movies.\n",
      "Fetched page 1940 with 24 movies.\n",
      "Fetched page 1941 with 24 movies.\n",
      "Fetched page 1942 with 24 movies.\n",
      "Fetched page 1943 with 24 movies.\n",
      "Fetched page 1944 with 24 movies.\n",
      "Fetched page 1945 with 24 movies.\n",
      "Fetched page 1946 with 24 movies.\n",
      "Fetched page 1947 with 24 movies.\n",
      "Fetched page 1948 with 24 movies.\n",
      "Fetched page 1949 with 24 movies.\n",
      "Fetched page 1950 with 24 movies.\n",
      "Fetched page 1951 with 24 movies.\n",
      "Fetched page 1952 with 24 movies.\n",
      "Fetched page 1953 with 24 movies.\n",
      "Fetched page 1954 with 24 movies.\n",
      "Fetched page 1955 with 24 movies.\n",
      "Fetched page 1956 with 24 movies.\n",
      "Fetched page 1957 with 24 movies.\n",
      "Fetched page 1958 with 24 movies.\n",
      "Fetched page 1959 with 24 movies.\n",
      "Fetched page 1960 with 24 movies.\n",
      "Fetched page 1961 with 24 movies.\n",
      "Fetched page 1962 with 24 movies.\n",
      "Fetched page 1963 with 24 movies.\n",
      "Fetched page 1964 with 24 movies.\n",
      "Fetched page 1965 with 24 movies.\n",
      "Fetched page 1966 with 24 movies.\n",
      "Fetched page 1967 with 24 movies.\n",
      "Fetched page 1968 with 24 movies.\n",
      "Fetched page 1969 with 24 movies.\n",
      "Fetched page 1970 with 24 movies.\n",
      "Fetched page 1971 with 24 movies.\n",
      "Fetched page 1972 with 24 movies.\n",
      "Fetched page 1973 with 24 movies.\n",
      "Fetched page 1974 with 24 movies.\n",
      "Fetched page 1975 with 24 movies.\n",
      "Fetched page 1976 with 24 movies.\n",
      "Fetched page 1977 with 24 movies.\n",
      "Fetched page 1978 with 24 movies.\n",
      "Fetched page 1979 with 24 movies.\n",
      "Fetched page 1980 with 24 movies.\n",
      "Fetched page 1981 with 24 movies.\n",
      "Fetched page 1982 with 24 movies.\n",
      "Fetched page 1983 with 24 movies.\n",
      "Fetched page 1984 with 24 movies.\n",
      "Fetched page 1985 with 24 movies.\n",
      "Fetched page 1986 with 24 movies.\n",
      "Fetched page 1987 with 24 movies.\n",
      "Fetched page 1988 with 24 movies.\n",
      "Fetched page 1989 with 24 movies.\n",
      "Fetched page 1990 with 24 movies.\n",
      "Fetched page 1991 with 24 movies.\n",
      "Fetched page 1992 with 24 movies.\n",
      "Fetched page 1993 with 24 movies.\n",
      "Fetched page 1994 with 24 movies.\n",
      "Fetched page 1995 with 24 movies.\n",
      "Fetched page 1996 with 24 movies.\n",
      "Fetched page 1997 with 24 movies.\n",
      "Fetched page 1998 with 24 movies.\n",
      "Fetched page 1999 with 24 movies.\n",
      "Fetched page 2000 with 24 movies.\n",
      "Fetched page 2001 with 24 movies.\n",
      "Fetched page 2002 with 24 movies.\n",
      "Fetched page 2003 with 24 movies.\n",
      "Fetched page 2004 with 24 movies.\n",
      "Fetched page 2005 with 24 movies.\n",
      "Fetched page 2006 with 24 movies.\n",
      "Fetched page 2007 with 24 movies.\n",
      "Fetched page 2008 with 24 movies.\n",
      "Fetched page 2009 with 24 movies.\n",
      "Fetched page 2010 with 24 movies.\n",
      "Fetched page 2011 with 24 movies.\n",
      "Fetched page 2012 with 24 movies.\n",
      "Fetched page 2013 with 24 movies.\n",
      "Fetched page 2014 with 24 movies.\n",
      "Fetched page 2015 with 24 movies.\n",
      "Fetched page 2016 with 24 movies.\n",
      "Fetched page 2017 with 24 movies.\n",
      "Fetched page 2018 with 24 movies.\n",
      "Fetched page 2019 with 24 movies.\n",
      "Fetched page 2020 with 24 movies.\n",
      "Fetched page 2021 with 24 movies.\n",
      "Fetched page 2022 with 24 movies.\n",
      "Fetched page 2023 with 24 movies.\n",
      "Fetched page 2024 with 24 movies.\n",
      "Fetched page 2025 with 24 movies.\n",
      "Fetched page 2026 with 24 movies.\n",
      "Fetched page 2027 with 24 movies.\n",
      "Fetched page 2028 with 24 movies.\n",
      "Fetched page 2029 with 24 movies.\n",
      "Fetched page 2030 with 24 movies.\n",
      "Fetched page 2031 with 24 movies.\n",
      "Fetched page 2032 with 24 movies.\n",
      "Fetched page 2033 with 24 movies.\n",
      "Fetched page 2034 with 24 movies.\n",
      "Fetched page 2035 with 24 movies.\n",
      "Fetched page 2036 with 24 movies.\n",
      "Fetched page 2037 with 24 movies.\n",
      "Fetched page 2038 with 24 movies.\n",
      "Fetched page 2039 with 24 movies.\n",
      "Fetched page 2040 with 24 movies.\n",
      "Fetched page 2041 with 24 movies.\n",
      "Fetched page 2042 with 24 movies.\n",
      "Fetched page 2043 with 24 movies.\n",
      "Fetched page 2044 with 24 movies.\n",
      "Fetched page 2045 with 24 movies.\n",
      "Fetched page 2046 with 24 movies.\n",
      "Fetched page 2047 with 24 movies.\n",
      "Fetched page 2048 with 24 movies.\n",
      "Fetched page 2049 with 24 movies.\n",
      "Fetched page 2050 with 24 movies.\n",
      "Fetched page 2051 with 24 movies.\n",
      "Fetched page 2052 with 24 movies.\n",
      "Fetched page 2053 with 24 movies.\n",
      "Fetched page 2054 with 24 movies.\n",
      "Fetched page 2055 with 24 movies.\n",
      "Fetched page 2056 with 24 movies.\n",
      "Fetched page 2057 with 24 movies.\n",
      "Fetched page 2058 with 24 movies.\n",
      "Fetched page 2059 with 24 movies.\n",
      "Fetched page 2060 with 24 movies.\n",
      "Fetched page 2061 with 24 movies.\n",
      "Fetched page 2062 with 24 movies.\n",
      "Fetched page 2063 with 24 movies.\n",
      "Fetched page 2064 with 24 movies.\n",
      "Fetched page 2065 with 24 movies.\n",
      "Fetched page 2066 with 24 movies.\n",
      "Fetched page 2067 with 24 movies.\n",
      "Fetched page 2068 with 24 movies.\n",
      "Fetched page 2069 with 24 movies.\n",
      "Fetched page 2070 with 24 movies.\n",
      "Fetched page 2071 with 24 movies.\n",
      "Fetched page 2072 with 24 movies.\n",
      "Fetched page 2073 with 24 movies.\n",
      "Fetched page 2074 with 24 movies.\n",
      "Fetched page 2075 with 24 movies.\n",
      "Fetched page 2076 with 24 movies.\n",
      "Fetched page 2077 with 24 movies.\n",
      "Fetched page 2078 with 24 movies.\n",
      "Fetched page 2079 with 24 movies.\n",
      "Fetched page 2080 with 24 movies.\n",
      "Fetched page 2081 with 24 movies.\n",
      "Fetched page 2082 with 24 movies.\n",
      "Fetched page 2083 with 24 movies.\n",
      "Fetched page 2084 with 24 movies.\n",
      "Failed to fetch movie details at page 2084. Status code: 500\n",
      "Writing movies to CSV...\n",
      "Movies written to CSV successfully.\n",
      "Writing images to CSV...\n",
      "Images written to CSV successfully.\n",
      "Writing trailers to CSV...\n",
      "Trailers written to CSV successfully.\n",
      "Writing actors to CSV...\n",
      "Actors written to CSV successfully.\n",
      "Writing directors to CSV...\n",
      "Directors written to CSV successfully.\n",
      "CSV generation completed.\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "import csv\n",
    "\n",
    "# Fonction pour récupérer tous les films depuis l'API MovieLens via l'exploration\n",
    "def get_all_movies_from_movielens():\n",
    "    auth_url = \"https://movielens.org/api/sessions\"\n",
    "    auth_data = {\"userName\": \"atf202\", \"password\": \"Bouboule12345\"}\n",
    "    \n",
    "    session = requests.Session()\n",
    "    response = session.post(auth_url, json=auth_data)\n",
    "\n",
    "    if response.status_code == 200:\n",
    "        print(\"Authenticated successfully with MovieLens API.\")\n",
    "        current_page = 1\n",
    "        all_movies = []\n",
    "\n",
    "        while True:\n",
    "            movie_url = f\"https://movielens.org/api/movies/explore?page={current_page}\"\n",
    "            movie_response = session.get(movie_url)\n",
    "\n",
    "            if movie_response.status_code == 200:\n",
    "                response_json = movie_response.json()\n",
    "\n",
    "                # Vérification si la réponse contient une erreur\n",
    "                if response_json.get(\"status\") == \"error\" and \"MLERR0\" in response_json.get(\"message\", \"\"):\n",
    "                    print(\"MovieLens application error MLERR0 encountered. Stopping the process.\")\n",
    "                    break\n",
    "\n",
    "                data = response_json.get(\"data\", {}).get(\"searchResults\", [])\n",
    "                if not data:\n",
    "                    print(\"No more movies to fetch. Process completed.\")\n",
    "                    break  # Fin des résultats\n",
    "\n",
    "                all_movies.extend(data)\n",
    "                current_page += 1\n",
    "                print(f\"Fetched page {current_page} with {len(data)} movies.\")\n",
    "            else:\n",
    "                print(f\"Failed to fetch movie details at page {current_page}. Status code: {movie_response.status_code}\")\n",
    "                break\n",
    "\n",
    "        return all_movies\n",
    "    else:\n",
    "        print(f\"Failed to authenticate with MovieLens API. Status code: {response.status_code}\")\n",
    "        return []\n",
    "\n",
    "# Fonction pour écrire les détails des films dans un fichier CSV\n",
    "def write_movies_to_csv(movies):\n",
    "    print(\"Writing movies to CSV...\")\n",
    "    with open('movies2.csv', mode='w', newline='', encoding='utf-8') as file:\n",
    "        writer = csv.writer(file)\n",
    "        # En-têtes du fichier CSV\n",
    "        writer.writerow([\"movieId\", \"title\", \"genres\", \"imdbId\", \"tmdbId\", \"plotSummary\", \"releaseDate\"])\n",
    "\n",
    "        for movie in movies:\n",
    "            movie_data = movie[\"movie\"]\n",
    "            writer.writerow([\n",
    "                movie_data[\"movieId\"],\n",
    "                movie_data[\"title\"],\n",
    "                \"|\".join(movie_data[\"genres\"]),\n",
    "                movie_data[\"imdbMovieId\"],\n",
    "                movie_data[\"tmdbMovieId\"],\n",
    "                movie_data[\"plotSummary\"],\n",
    "                movie_data[\"releaseDate\"]\n",
    "            ])\n",
    "    print(\"Movies written to CSV successfully.\")\n",
    "\n",
    "# Fonction pour écrire les images dans un fichier CSV\n",
    "def write_images_to_csv(movies):\n",
    "    print(\"Writing images to CSV...\")\n",
    "    with open('images.csv', mode='w', newline='', encoding='utf-8') as file:\n",
    "        writer = csv.writer(file)\n",
    "        # En-têtes du fichier CSV pour les images\n",
    "        writer.writerow([\"movieId\", \"posterPath\", \"backdropPath\"])\n",
    "\n",
    "        for movie in movies:\n",
    "            movie_data = movie[\"movie\"]\n",
    "            poster_path = f\"https://image.tmdb.org/t/p/original{movie_data['posterPath']}\" if movie_data['posterPath'] else \"\"\n",
    "            for backdrop in movie_data.get('backdropPaths', []):\n",
    "                writer.writerow([\n",
    "                    movie_data[\"movieId\"],\n",
    "                    poster_path,\n",
    "                    f\"https://image.tmdb.org/t/p/original{backdrop}\"\n",
    "                ])\n",
    "    print(\"Images written to CSV successfully.\")\n",
    "\n",
    "# Fonction pour écrire les trailers dans un fichier CSV\n",
    "def write_trailers_to_csv(movies):\n",
    "    print(\"Writing trailers to CSV...\")\n",
    "    with open('trailers.csv', mode='w', newline='', encoding='utf-8') as file:\n",
    "        writer = csv.writer(file)\n",
    "        # En-têtes du fichier CSV pour les trailers\n",
    "        writer.writerow([\"movieId\", \"trailerId\"])\n",
    "\n",
    "        for movie in movies:\n",
    "            movie_data = movie[\"movie\"]\n",
    "            for trailer in movie_data.get(\"youtubeTrailerIds\", []):\n",
    "                writer.writerow([movie_data[\"movieId\"], trailer])\n",
    "    print(\"Trailers written to CSV successfully.\")\n",
    "\n",
    "# Fonction pour écrire les acteurs dans un fichier CSV\n",
    "def write_actors_to_csv(movies):\n",
    "    print(\"Writing actors to CSV...\")\n",
    "    with open('actors.csv', mode='w', newline='', encoding='utf-8') as file:\n",
    "        writer = csv.writer(file)\n",
    "        # En-têtes du fichier CSV pour les acteurs\n",
    "        writer.writerow([\"movieId\", \"actor\"])\n",
    "\n",
    "        for movie in movies:\n",
    "            movie_data = movie[\"movie\"]\n",
    "            for actor in movie_data.get(\"actors\", []):\n",
    "                writer.writerow([movie_data[\"movieId\"], actor])\n",
    "    print(\"Actors written to CSV successfully.\")\n",
    "\n",
    "# Fonction pour écrire les réalisateurs dans un fichier CSV\n",
    "def write_directors_to_csv(movies):\n",
    "    print(\"Writing directors to CSV...\")\n",
    "    with open('directors.csv', mode='w', newline='', encoding='utf-8') as file:\n",
    "        writer = csv.writer(file)\n",
    "        # En-têtes du fichier CSV pour les réalisateurs\n",
    "        writer.writerow([\"movieId\", \"director\"])\n",
    "\n",
    "        for movie in movies:\n",
    "            movie_data = movie[\"movie\"]\n",
    "            for director in movie_data.get(\"directors\", []):\n",
    "                writer.writerow([movie_data[\"movieId\"], director])\n",
    "    print(\"Directors written to CSV successfully.\")\n",
    "\n",
    "# Fonction principale pour générer les fichiers CSV\n",
    "def generate_csvs():\n",
    "    print(\"Fetching all movies from MovieLens API...\")\n",
    "    all_movies = get_all_movies_from_movielens()\n",
    "    if all_movies:\n",
    "        write_movies_to_csv(all_movies)       # Pour les films\n",
    "        write_images_to_csv(all_movies)       # Pour les images\n",
    "        write_trailers_to_csv(all_movies)     # Pour les trailers\n",
    "        write_actors_to_csv(all_movies)       # Pour les acteurs\n",
    "        write_directors_to_csv(all_movies)    # Pour les réalisateurs\n",
    "\n",
    "# Exécuter la génération des CSVs\n",
    "print(\"Starting process to generate CSVs...\")\n",
    "generate_csvs()\n",
    "print(\"CSV generation completed.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Connexion à Neo4j\n",
    "uri = \"bolt://localhost:7687\"\n",
    "username = \"neo4j\"\n",
    "password = \"password\"\n",
    "\n",
    "print(\"Initializing Neo4j connection...\")\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "print(\"Neo4j connection initialized successfully.\")\n",
    "\n",
    "# Fonction pour charger les films dans Neo4j\n",
    "def load_movies():\n",
    "    print(\"Loading movies into Neo4j...\")\n",
    "    query = \"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///movies2.csv' AS row\n",
    "    MERGE (m:Movie {movieId: toInteger(row.movieId)})\n",
    "    SET m.title = row.title,\n",
    "        m.genres = row.genres,\n",
    "        m.imdbId = row.imdbId,\n",
    "        m.tmdbId = row.tmdbId,\n",
    "        m.plotSummary = row.plotSummary,\n",
    "        m.releaseDate = row.releaseDate\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        session.run(query)\n",
    "    print(\"Movies loaded into Neo4j.\")\n",
    "\n",
    "# Fonction pour charger les images dans Neo4j\n",
    "def load_images():\n",
    "    print(\"Loading images into Neo4j...\")\n",
    "    query = \"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///images.csv' AS row\n",
    "    MERGE (m:Movie {movieId: toInteger(row.movieId)})\n",
    "    MERGE (i:Image {posterPath: row.posterPath, backdropPath: row.backdropPath})\n",
    "    MERGE (m)-[:HAS_IMAGE]->(i)\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        session.run(query)\n",
    "    print(\"Images loaded into Neo4j.\")\n",
    "\n",
    "# Fonction pour charger les trailers dans Neo4j\n",
    "def load_trailers():\n",
    "    print(\"Loading trailers into Neo4j...\")\n",
    "    query = \"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///trailers.csv' AS row\n",
    "    MERGE (m:Movie {movieId: toInteger(row.movieId)})\n",
    "    MERGE (t:Trailer {trailerId: row.trailerId})\n",
    "    MERGE (m)-[:HAS_TRAILER]->(t)\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        session.run(query)\n",
    "    print(\"Trailers loaded into Neo4j.\")\n",
    "\n",
    "# Fonction pour charger les acteurs dans Neo4j\n",
    "def load_actors():\n",
    "    print(\"Loading actors into Neo4j...\")\n",
    "    query = \"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///actors.csv' AS row\n",
    "    MERGE (a:Actor {name: row.actor})\n",
    "    MERGE (m:Movie {movieId: toInteger(row.movieId)})\n",
    "    MERGE (a)-[:ACTED_IN]->(m)\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        session.run(query)\n",
    "    print(\"Actors loaded into Neo4j.\")\n",
    "\n",
    "# Fonction pour charger les réalisateurs dans Neo4j\n",
    "def load_directors():\n",
    "    print(\"Loading directors into Neo4j...\")\n",
    "    query = \"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///directors.csv' AS row\n",
    "    MERGE (d:Director {name: row.director})\n",
    "    MERGE (m:Movie {movieId: toInteger(row.movieId)})\n",
    "    MERGE (d)-[:DIRECTED]->(m)\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        session.run(query)\n",
    "    print(\"Directors loaded into Neo4j.\")\n",
    "\n",
    "# Fonction principale pour charger toutes les données\n",
    "def load_data_into_neo4j():\n",
    "    load_movies()       # Charger les films\n",
    "    load_images()       # Charger les images\n",
    "    load_trailers()     # Charger les trailers\n",
    "    load_actors()       # Charger les acteurs\n",
    "    load_directors()    # Charger les réalisateurs\n",
    "\n",
    "# Exécution du chargement des données\n",
    "print(\"Starting data load into Neo4j...\")\n",
    "load_data_into_neo4j()\n",
    "print(\"Data loading completed.\")\n",
    "\n",
    "# Fermer la connexion Neo4j\n",
    "driver.close()\n",
    "print(\"Neo4j connection closed.\")\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
